{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<perm=low>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<perm=high>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<perm=unknown>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Strip",
    "strip_left": false,
    "strip_right": true
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          1
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<perm=low>": 4,
      "<perm=high>": 5,
      "<perm=unknown>": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      "/": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "=": 18,
      "@": 19,
      "B": 20,
      "C": 21,
      "F": 22,
      "H": 23,
      "N": 24,
      "O": 25,
      "S": 26,
      "[": 27,
      "\\": 28,
      "]": 29,
      "c": 30,
      "l": 31,
      "n": 32,
      "o": 33,
      "r": 34,
      "s": 35,
      "C(": 36,
      "C)": 37,
      "=O": 38,
      "=O)": 39,
      "H]": 40,
      "C@": 41,
      "[C@": 42,
      "H](": 43,
      "cc": 44,
      "CC": 45,
      "[C@@": 46,
      "C(=O)": 47,
      "C)C)": 48,
      "N(": 49,
      "[C@H](": 50,
      "[C@@H](": 51,
      "CC(": 52,
      "CC(C)C)": 53,
      "CCC": 54,
      "c1": 55,
      "cccc": 56,
      "C(=O)N": 57,
      "N(C)": 58,
      "C(N": 59,
      "2)": 60,
      "=O)=O)": 61,
      "[C@@H]": 62,
      "[C@H]": 63,
      "NC(=O)": 64,
      "NC(": 65,
      "C1": 66,
      "C)=O)": 67,
      "[C@@H](CC(C)C)": 68,
      "[C@H](CC(C)C)": 69,
      "c1cccc": 70,
      "Cc": 71,
      "c1ccccc1": 72,
      "ccccc": 73,
      "CCC2)": 74,
      "Cc1ccccc1": 75,
      "CC(C)C)=O)": 76,
      "2CCC": 77,
      "Cc1ccccc1)": 78,
      "Cc2": 79,
      "1)": 80,
      "N(C(=O)": 81,
      "N(C(": 82,
      "ccccc2)": 83,
      "Cc2ccccc2)": 84,
      "[C@@H](C)": 85,
      "[C@@H]1": 86,
      "[C@H]1": 87,
      "C(=O)N(": 88,
      "N1": 89,
      "C(N(": 90,
      "N2": 91,
      "[C@H](C(=O)N": 92,
      "[C@H](C(N": 93,
      "C)C": 94,
      "N(C)C(": 95,
      "[C@@H]2": 96,
      "N(C)C(=O)": 97,
      "[C@H]2": 98,
      "C(=O)N(C)": 99,
      "3)": 100,
      "[C@H](C)": 101,
      "2CCCN2": 102,
      "[C@@H](NC(=O)": 103,
      "[C@@H](NC(": 104,
      "C(N(C)": 105,
      "C)=O)=O)": 106,
      "O)": 107,
      "C1=O)": 108,
      "Cc1ccccc1)=O)": 109,
      "C(C)C)": 110,
      "C(=O)N[C@@H](": 111,
      "CC(C)C": 112,
      "C)CC(C)C)": 113,
      "CCC1)": 114,
      "C(N[C@@H](": 115,
      "[C@H](Cc2ccccc2)": 116,
      "c(": 117,
      "CCC2)=O)": 118,
      "Cc3": 119,
      "O=": 120,
      "[C@H]2CCCN2": 121,
      "N(CCC2)": 122,
      "[C@@H]2CCCN2": 123,
      "CC(N": 124,
      "[C@H](NC(=O)": 125,
      "ccccc3)": 126,
      "CC(C)C)=O)=O)": 127,
      "C)C)=O)": 128,
      "[C@H](NC(": 129,
      "Cc3ccccc3)": 130,
      "C1(": 131,
      "2CCC[C@@H]2": 132,
      "O=C1": 133,
      "CN(": 134,
      "C)CC(C)C)=O)": 135,
      "2CCC[C@H]2": 136,
      "[C@@H](CC(C)C)C(N": 137,
      "CCC3)": 138,
      "[C@@H](CC(C)C)C(=O)N": 139,
      "CC(=O)N": 140,
      "1CC": 141,
      "1)=O)": 142,
      "C)=O": 143,
      "2[C@@H](": 144,
      "OC(": 145,
      "3CCC": 146,
      "C1=O)=O)": 147,
      "c1cc": 148,
      "C)(": 149,
      "2CC": 150,
      "[C@@H](Cc2ccccc2)": 151,
      "[C@@H](N(C(=O)": 152,
      "[C@@H](N(C(": 153,
      "[C@@H](N(C)C(": 154,
      "[C@@H](N(C)C(=O)": 155,
      "[C@H](C(N(": 156,
      "CC(C)C)C)=O)": 157,
      "[C@H](C(=O)N(": 158,
      "[C@@H](C(=O)N": 159,
      "1CCCCC1)": 160,
      "[C@H](C": 161,
      "[C@@H](C(N": 162,
      "[C@H](O)": 163,
      "[C@H](CC(C)C)NC(=O)": 164,
      "[C@H](CC(C)C)NC(": 165,
      "[C@@H](C)O)": 166,
      "C[C@@H]1": 167,
      "C[C@H]1": 168,
      "C1)": 169,
      "2[C@H](": 170,
      "[C@H](CC(C)C)C(=O)N": 171,
      "[C@H](CC(C)C)C(N": 172,
      "CC(C)C)=O": 173,
      "CCCN1": 174,
      "NC1=O)": 175,
      "[C@H](C(N(C)": 176,
      "CCCC": 177,
      "[C@H](C(=O)N(C)": 178,
      "CN1": 179,
      "[C@@H]2N(CCC2)": 180,
      "=O)=O)=O)": 181,
      "CCCC)": 182,
      "CN(C(=O)": 183,
      "[C@H]2N(CCC2)": 184,
      "CN(C(": 185,
      "[C@@H](CC(C)C)NC(": 186,
      "[C@@H](CC(C)C)NC(=O)": 187,
      "C1(=O)": 188,
      "C2": 189,
      "c1)": 190,
      "[C@H]2CCCN2C(=O)": 191,
      "[C@H]2CCCN2C(": 192,
      "[C@@H]2CCCN2C(=O)": 193,
      "[C@@H]2CCCN2C(": 194,
      "C(O": 195,
      "[C@H](CC(C)C)N(C(": 196,
      "C(=O)O": 197,
      "[C@H](CC(C)C)N(C)C(": 198,
      "[C@H](CC(C)C)N(C(=O)": 199,
      "N3": 200,
      "[C@H](CC(C)C)N(C)C(=O)": 201,
      "C)=O)C)=O)": 202,
      "OC(=O)": 203,
      "2[C@H](CCC2)": 204,
      "3CCCN3": 205,
      "[C@@H]3": 206,
      "Cc1ccccc1)=O)=O)": 207,
      "[C@@H](C)C": 208,
      "[C@H]3": 209,
      "C)=O)CC(C)C)=O)": 210,
      "[C@H](Cc3ccccc3)": 211,
      "[C@@H]1(": 212,
      "c1ccc(": 213,
      "N1(": 214,
      "[C@H]1(": 215,
      "2[C@@H](CCC2)": 216,
      "c2": 217,
      "F)": 218,
      "CC(N(": 219,
      "[C@H](Cc2ccccc2)NC(": 220,
      "2CCCCC2)": 221,
      "[C@H](N(C)C(=O)": 222,
      "OC(C)(": 223,
      "[C@H](N(C(=O)": 224,
      "[C@H](Cc2ccccc2)NC(=O)": 225,
      "C)=O)CC(C)C)": 226,
      "[C@H](O)C)": 227,
      "[C@H](N(C)C(": 228,
      "[C@H](N(C(": 229,
      "Cc1ccccc1)=O": 230,
      "CCC)": 231,
      "[C@H](C(=O)N[C@@H](": 232,
      "Cc2cc": 233,
      "N(C1=O)": 234,
      "[C@H](C(N[C@@H](": 235,
      "N1)": 236,
      "(C": 237,
      "C)=O)=O)=O)": 238,
      "C2=O)": 239,
      "CC(N(C)": 240,
      "[C@@H](C)C(=O)N": 241,
      "[C@@H](C)C(N": 242,
      "C(=O)N[C@@H](Cc2ccccc2)": 243,
      "C(C)(": 244,
      "cc1)": 245,
      "1CCCCC1)=O)": 246,
      "CC(=O)N(": 247,
      "[C@H](CC)C)": 248,
      "[C@@H]1CCCN1": 249,
      "[C@@H](NC1=O)": 250,
      "C)=O)C": 251,
      "[C@H](C(C)C)": 252,
      "2CCCCC2)=O)": 253,
      "NC1=O)=O)": 254,
      "N(CCC1)": 255,
      "C(C)C)=O)": 256,
      "OC(C)(C)C)": 257,
      "CC(=O)N(C)": 258,
      "OCC": 259,
      "[C@@H](CC(C)C)N(C(=O)": 260,
      "[C@@H](CC(C)C)N(C(": 261,
      "cc2)": 262,
      "[C@@H](CC(C)C)N(C)C(=O)": 263,
      "[C@@H]2N(C(=O)": 264,
      "[C@@H](CC(C)C)N(C)C(": 265,
      "O=C1N": 266,
      "[C@@H]2N(C(": 267,
      "[C@@H](CC(C)C)C(N[C@@H](": 268,
      "[C@H]2N(C(=O)": 269,
      "[C@@H]2N(CCC2)C(": 270,
      "C1CC": 271,
      "[C@@H]2N(CCC2)C(=O)": 272,
      "[C@H]2N(C(": 273,
      "[C@H]2N(CCC2)C(": 274,
      "C)CC(C)C)=O)=O)": 275,
      "C(C)C": 276,
      "CC(C)C)=O)CC(C)C)=O)": 277,
      "[C@@H](CC(C)C)C(N(": 278,
      "CC(C)C)C": 279,
      "[C@@H](CC(C)C)C(=O)N(": 280,
      "[C@H]2N(CCC2)C(=O)": 281,
      "CN(Cc2ccccc2)": 282,
      "[C@H](C)NC(=O)": 283,
      "CCC3)=O)": 284,
      "c2)": 285,
      "[C@H](C)NC(": 286,
      "C1)=O)": 287,
      "C)=O)C)": 288,
      "[C@@H](C)CC)": 289,
      "CC(C)C)C)": 290,
      "[C@@H]3CCCN3": 291,
      "C)C)=O)=O)": 292,
      "[C@H](CCCC)": 293,
      "c1c(": 294,
      "1)=O)=O)": 295,
      "2)=O)": 296,
      "N(CCC3)": 297,
      "[C@H]3CCCN3": 298,
      "[C@H](OC(=O)": 299,
      "OC": 300,
      "[C@H](OC(": 301,
      "[C@@H](C)OC(": 302,
      "C(=O)N[C@H](C(N": 303,
      "CCC2": 304,
      "[C@@H](C)OC(=O)": 305,
      "C(N[C@H](C(N": 306,
      "C(=O)N[C@H](C(=O)N": 307,
      "C)=O)=O": 308,
      "[C@@H](C(N(": 309,
      "[C@H]1CCCN1": 310,
      "[C@@H](C(=O)N(": 311,
      "C(N[C@H](C(=O)N": 312,
      "[C@@H](CC(C)C)C(N(C)": 313,
      "[C@@H](C(C)C)": 314,
      "3CCC[C@@H]3": 315,
      "[C@@H](CC(C)C)C(=O)N[C@@H](": 316,
      "[C@@H](CC(C)C)C(=O)N(C)": 317,
      "C(N[C@@H](Cc2ccccc2)": 318,
      "c1ccccc1)": 319,
      "C1C": 320,
      "Cc2ccc(": 321,
      "C(C(C)C)": 322,
      "c1ccc(cc1)": 323,
      "3CCC[C@H]3": 324,
      "CCC2)=O)=O)": 325,
      "CC(C)C[C@H]1": 326,
      "N1C(": 327,
      "C(N1": 328,
      "N1C(=O)": 329,
      "c3": 330,
      "CC(C)C[C@@H]1": 331,
      "C(C)=O)=O)": 332,
      "CC(C[C@@H]1": 333,
      "CC(C[C@H]1": 334,
      "CC(C)C)CC(C)C)=O)": 335,
      "CC(C)C)=O)=O)=O)": 336,
      "C([C@H]1": 337,
      "[C@H](C1=O)": 338,
      "4)": 339,
      "N(C)C1=O)": 340,
      "Cc2ccccc2)=O)": 341,
      "C)CC(C)C)=O": 342,
      "CC(C)C)C)=O)=O)": 343,
      "C([C@@H]1": 344,
      "[C@H]([C@H](O)C)": 345,
      "[C@H]([C@@H](C)O)": 346,
      "CCC2)=O": 347,
      "OCO": 348,
      "l)": 349,
      "CC(=O)N[C@@H](": 350,
      "[C@@H](C(N(C)": 351,
      "C)Cc1ccccc1)": 352,
      "2CCC[C@@H]2C(N(": 353,
      "C)CC(C)C": 354,
      "C)Cc1ccccc1)=O)": 355,
      "2CCC[C@@H]2C(=O)N(": 356,
      "[C@H](C)N(C)C(": 357,
      "C(O[C@@H](": 358,
      "cn": 359,
      "[C@H](C)N(C)C(=O)": 360,
      "C(=O)O[C@@H](": 361,
      "C(=O)O[C@H](C)": 362,
      "CC(C)C)=O)C": 363,
      "[C@@H](C(=O)N(C)": 364,
      "[C@@H](Cc2ccccc2)C(=O)N": 365,
      "[C@H](Cc3ccccc3)NC(=O)": 366,
      "C(O[C@H](C)": 367,
      "[C@@H]1CCCN1C(=O)": 368,
      "[C@@H](C)O)=O)": 369,
      "[C@@H](N1)": 370,
      "[C@H]1N(CCC1)": 371,
      "CC1": 372,
      "[C@H](C)N(C(=O)": 373,
      "[C@@H](Cc2ccccc2)C(N": 374,
      "C(N1CCCCC1)": 375,
      "CN(CCC)": 376,
      "[C@H](Cc3ccccc3)NC(": 377,
      "C)=O)Cc1ccccc1)": 378,
      "COC(C)(C)C)": 379,
      "(cc": 380,
      "[C@H](C(=O)N[C@H](C(=O)N": 381,
      "CC)": 382,
      "CCCO": 383,
      "N(C(=O)C)": 384,
      "[C@H](C)N(C(": 385,
      "CCC1": 386,
      "C[C@@H]1NC(=O)": 387,
      "[C@H](CC(C)C)C(N(": 388,
      "[C@H](CC(C)C)C(=O)N(": 389,
      "N1(C)": 390,
      "N(C(C)=O)": 391,
      "C)=O)Cc1ccccc1)=O)": 392,
      "[C@H](C(N[C@H](C(N": 393,
      "CC(C)C)=O)=O": 394,
      "[C@H](NC1=O)": 395,
      "C(C)(C)C": 396,
      "C1(=O)N": 397,
      "[C@H](C(N[C@H](C(=O)N": 398,
      "C2=O)=O)": 399,
      "C1(N": 400,
      "[C@H](C)C(=O)N": 401,
      "C[C@@H]1NC(": 402,
      "C)C)=O": 403,
      "C[C@H](NC(=O)": 404,
      "C[C@H](NC(": 405,
      "[C@@H](C)NC(": 406,
      "CCC1)=O)": 407,
      "CC(C)C)=O)CC(C)C)": 408,
      "cc1": 409,
      "CN(CC": 410,
      "C)=O)C)CC(C)C)=O)": 411,
      "Cc1cc": 412,
      "C[C@@H](C(=O)N": 413,
      "[C@H](C)C(N": 414,
      "C)NC(=O)": 415,
      "[C@@H](C)C(=O)N(": 416,
      "C[C@@H](NC(=O)": 417,
      "C)NC(": 418,
      "[C@@H](C(=O)N[C@@H](": 419,
      "[C@@H](C)C(N(": 420,
      "[C@H](C(=O)N[C@H](C(N": 421,
      "C[C@@H](NC(": 422,
      "C[C@@H](C(N": 423,
      "2CCC[C@H]2C(N(": 424,
      "C(=O)N1": 425,
      "[C@@H](C)NC(=O)": 426,
      "[C@@H](C(N[C@@H](": 427,
      "C(=O)N1CCCCC1)": 428,
      "C)=O)C)CC(C)C)": 429,
      "2CCC[C@H]2C(=O)N(": 430,
      "CN1C(=O)": 431,
      "[C@H](CC(C)C)C(=O)N(C)": 432,
      "CN1C(": 433,
      "CC(N2": 434,
      "CC(C)C)C)=O": 435,
      "Cl)": 436,
      "CCCOC(C)C)": 437,
      "[C@H](CC(C)C)C(N(C)": 438,
      "CC1)": 439,
      "C)=O)CCC2)=O)": 440,
      "CN(Cc3ccccc3)": 441,
      "C)=O)CC(C)C": 442,
      "CN(Cc2ccccc2)C(": 443,
      "(C)C": 444,
      "(c1)": 445,
      "2=O)": 446,
      "N2C(=O)": 447,
      "O=C1N(": 448,
      "CN(Cc2ccccc2)C(=O)": 449,
      "[C@@H]3N(CCC3)": 450,
      "[C@H]3N(CCC3)": 451,
      "N2C(": 452,
      "N1)=O)": 453,
      "C(=O)O[C@@H]1": 454,
      "[C@H](C(=O)N1)": 455,
      "C1=O)=O)=O)": 456,
      "C)C)CC(C)C)=O)": 457,
      "(C[C@H]2": 458,
      "3CC": 459,
      "C(O[C@@H]1": 460,
      "4ccccc": 461,
      "[C@H](CC(C)C)C(=O)N[C@@H](": 462,
      "[C@H](CC(C)C)C(N[C@@H](": 463,
      "[C@H](C(N1)=O)": 464,
      "ccc(": 465,
      "cccc1)": 466,
      "ccc1": 467,
      "C)=O)C)=O)=O)": 468,
      "3[C@@H](": 469,
      "C(N1CCCCC1)=O)=O)": 470,
      "CC(C)C)CC(C)C)": 471,
      "C)=O)CC(C)C)C)=O)": 472,
      "c2ccccc2)": 473,
      "c1cc(cc": 474,
      "Cc1ccccc1)=O)=O": 475,
      "c1cccc(c1)": 476,
      "3[C@H](": 477,
      "[C@H]1CCCN1C(=O)": 478,
      "[C@@H]1CC(C)C)=O)": 479,
      "[C@@H]1N(CCC1)": 480,
      "C(N1CCCCC1)=O)": 481,
      "C(=O)N1CCCCC1)=O)": 482,
      "C[C@@H](C(=O)N2CCCCC2)": 483,
      "c1c(cccc1)": 484,
      "[C@H]([C@@H](C)CC)": 485,
      "c1c(C": 486,
      "c1(": 487,
      "CN(C)C(": 488,
      "C)=O)CCC2)": 489,
      "[C@@H]3CCCN3C(=O)": 490,
      "C[C@@H](C(N2CCCCC2)=O)": 491,
      "CN(C)C(=O)": 492,
      "C)=O)CC(C)C)=O)=O)": 493,
      "[C@H]1CC(C)C)=O)": 494,
      "C)CCC2)=O)": 495,
      "4ccccc4)": 496,
      "[C@H](CC(=O)N": 497,
      "3[C@H](CCC3)": 498,
      "NC2=O)": 499,
      "[C@H]1(CC(C)C)": 500,
      "[C@@H](Cc3ccccc3)": 501,
      "[C@@H]1NC(=O)": 502,
      "[C@H]3CCCN3C(=O)": 503,
      "(C[C@@H]2": 504,
      "[C@@H](N1": 505,
      "F)F)": 506,
      "C(C(C)C)[C@H]1": 507,
      "Cc4ccccc4)": 508,
      "[C@H](Cc2ccccc2)N(C(=O)": 509,
      "[C@H](COC(C)(C)C)": 510,
      "[C@@H](C)C(N(C)": 511,
      "c1cc(ccc1)": 512,
      "Cc2ccc(cc2)": 513,
      "[C@H]([C@H](CC)C)": 514,
      "ccccc1": 515,
      "[C@@H]1NC(": 516,
      "CCCC)C(N": 517,
      "2CCC[C@H]2C(=O)N": 518,
      "[C@@H]1(CC(C)C)": 519,
      "cccc1": 520,
      "[C@@H](C)N(C(": 521,
      "Cc1ccccc1)=O)C": 522,
      "3[C@@H](CCC3)": 523,
      "[C@@H](C)N(C)C(": 524,
      "[C@H](CCCC)NC(=O)": 525,
      "[C@@H](C)C(=O)N(C)": 526,
      "[C@H]3CCCN3C(": 527,
      "c1ccc(C": 528,
      "CCCC)C(=O)N": 529,
      "[C@@H]3CCCN3C(": 530,
      "[C@H](CC": 531,
      "Cc2ccccc2)CC(=O)N": 532,
      "[C@@H](Cc1ccccc1)": 533,
      "[C@H](CCCC)NC(": 534,
      "CCC)C": 535,
      "[C@@H](C)N(C)C(=O)": 536,
      "2CCC[C@H]2C(N": 537,
      "C(c1ccccc1)": 538,
      "[C@@H]1CCCN1C(": 539,
      "CC1CC": 540,
      "[C@H](CC)C)=O)": 541,
      "Cc2ccccc2)CC(N": 542,
      "[C@H](Cc2ccccc2)N(C)C(": 543,
      "C(=O)N[C@@H](Cc2ccccc2)C(=O)N": 544,
      "c1(cccc": 545,
      "c1(ccccc1)": 546,
      "[C@H](Cc2ccccc2)N(C(": 547,
      "[n": 548,
      "[nH]": 549,
      "2CCC[C@@H]2C(=O)N": 550,
      "[C@@H](N(C1=O)": 551,
      "2CCC[C@@H]2C(N": 552,
      "CC(C)C)C)CC(C)C)": 553,
      "[C@@H](NC(=O)[C@@H](N(C)C(": 554,
      "[C@H](Cc2ccccc2)N(C)C(=O)": 555,
      "[C@H](Cc1ccccc1)": 556,
      "CCO": 557,
      "[C@@H](CC(C)C)C(=O)N[C@H](C(=O)N": 558,
      "OC(C)(C)C)=O)": 559,
      "[C@@H](N(C)C1=O)": 560,
      "C(=O)N[C@@H](Cc2ccccc2)C(N": 561,
      "[C@@H](NC([C@@H](N(C)C(": 562,
      "C[C@H]1C(N": 563,
      "C(=O)N[C@@H](C(N": 564,
      "C(=O)N[C@@H](C(=O)N": 565,
      "[C@@H](NC([C@@H](N(C(=O)": 566,
      "[C@@H](NC(=O)[C@@H](N(C(=O)": 567,
      "Cc1ccccc1)C": 568,
      "[C@@H](NC(=O)[C@@H](N(C)C(=O)": 569,
      "[C@@H](CC(C)C)C(=O)N[C@H](C(N": 570,
      "[C@@H](CC(C)C)C(N[C@H](C(=O)N": 571,
      "[C@@H](C)N(C(=O)": 572,
      "C1)=O)=O)": 573,
      "[C@@H](NC(=O)[C@@H](N(C(": 574,
      "C[C@H]1C(=O)N": 575,
      "[C@H]1N(CCC1)C(=O)": 576,
      "C(N[C@@H](C(N": 577,
      "[C@@H](NC([C@@H](N(C)C(=O)": 578,
      "[C@@H](CC(C)C)C(N[C@H](C(N": 579,
      "C)CCC2)": 580,
      "Cc1ccccc1)=O)=O)=O)": 581,
      "[C@H]([C@H](O)C)NC(=O)": 582,
      "[C@H]([C@@H](C)O)NC(": 583,
      "C)=O)C)C)": 584,
      "C(N[C@@H](C(=O)N": 585,
      "[C@H]([C@H](O)C)NC(": 586,
      "OCC2)": 587,
      "[C@@H](NC([C@@H](N(C(": 588,
      "2[C@@H](C(=O)N(": 589,
      "C)=O)CC(C)C)=O": 590,
      "[C@H]([C@H](OC(=O)": 591,
      "C)=O)=O)CC(C)C)=O)": 592,
      "[C@H]([C@H](OC(": 593,
      "[C@H]([C@@H](C)O)NC(=O)": 594,
      "[C@H](C2=O)": 595,
      "[C@H]([C@@H](C)OC(=O)": 596,
      "[C@H]([C@@H](C)OC(": 597,
      "[C@H](CC(N": 598,
      "2[C@H](CCC2)C(=O)N(": 599,
      "CC(C)C)C)C)=O)": 600,
      "[C@H]1N(C(=O)C)": 601,
      "[C@@H](NC([C@@H](NC(": 602,
      "C2)": 603,
      "Cc3ccccc3)C(N": 604,
      "O=C1N(C)": 605,
      "N(C)C1=O)=O)": 606,
      "Cc3ccccc3)C(=O)N": 607,
      "CN(CCC)C(=O)": 608,
      "CC1CCOCC": 609,
      "2[C@@H](C(N(": 610,
      "F)(": 611,
      "CN(CCC)C(": 612,
      "C)=O)C)C)=O)": 613,
      "C)=O)=O)C": 614,
      "C)=O)C)=O": 615,
      "CC(C)C)C)C)": 616,
      "CC(C)C)C)CC(C)C)=O)": 617,
      "Cc1ccccc1)=O)CC(C)C)=O)": 618,
      "2[C@H](CCC2)C(N(": 619,
      "C[C@H](Cc2ccccc2)NC(=O)": 620,
      "[C@@H](Cc2ccccc2)C(=O)N(": 621,
      "N12": 622,
      "Cc3ccccc3)CC(N": 623,
      "CC(N1": 624,
      "[C@H]1N(C(C)=O)": 625,
      "Cc1ccc(": 626,
      "[C@@H](NC([C@@H](NC(=O)": 627,
      "C[C@H](Cc2ccccc2)NC(": 628,
      "N(C2=O)": 629,
      "[C@@H](Cc2ccccc2)C(N(": 630,
      "[C@H](N1)": 631,
      "[C@@H]1CCCN1C(C)=O)=O)": 632,
      "CC1CCCCC1)": 633,
      "CCCC)=O)": 634,
      "[C@H](C)C(N(": 635,
      "NC1=O)=O)=O)": 636,
      "N)": 637,
      "CNC(": 638,
      "CCCCC)": 639,
      "[C@@H](NC(=O)[C@@H](NC(=O)": 640,
      "C(F)(": 641,
      "[C@H](C)C(=O)N(": 642,
      "CNC(=O)": 643,
      "CC(C)C)Cc1ccccc1)=O)": 644,
      "[C@@H](C": 645,
      "[C@H]1CCCN1C(": 646,
      "[C@H](C(=O)N1": 647,
      "C(C)(C)C[C@H]1": 648,
      "[C@@H]12": 649,
      "[C@H](C(N1": 650,
      "1)=O)=O)=O)": 651,
      "C(C(C)C)[C@@H]1": 652,
      "2CCC[C@@H]2C(=O)N(C)": 653,
      "2CCC[C@@H]2C(N(C)": 654,
      "CC1=O)": 655,
      "ccccc2": 656,
      "2CCC[C@H]2C(=O)N(C)": 657,
      "[C@H]12": 658,
      "C(C)C)=O)=O)": 659,
      "C)CC": 660,
      "Cc1ccc(cc1)": 661,
      "Cc1ccccc1)CC(C)C)=O)": 662,
      "2CCC[C@H]2C(N(C)": 663,
      "CCC[C@H]1": 664,
      "C)=O)=O)=O": 665,
      "[C@@H](NC(=O)[C@@H](NC(": 666,
      "N1(C(=O)": 667,
      "C)C)CC(C)C)": 668,
      "C1(=O)N(": 669,
      "1)=O)CC(C)C)=O)": 670,
      "2CCOCC2)": 671,
      "[C@H](CC(C)C)N1": 672,
      "3CCCCC3)": 673,
      "N1(C(": 674,
      "[C@@H](C)O": 675,
      "C1(N(": 676,
      "[C@@H](Cc2ccccc2)C(=O)N(C)": 677,
      "2[C@@H](CCC2)C(=O)N(": 678,
      "c3)": 679,
      "OC)": 680,
      "[C@@H]1C(=O)N": 681,
      "Cc2cc3": 682,
      "[C@@H](Cc2ccccc2)C(N(C)": 683,
      "c2c(": 684,
      "CC(=O)N1": 685,
      "[C@@H](C(=O)N1)": 686,
      "C2)=O)": 687,
      "c1)=O)": 688,
      "[C@H]1[C@@H](C)OC(": 689,
      "NC([C@@H](N(C(=O)": 690,
      "2[C@H](C(N(": 691,
      "2[C@H](C(=O)N(": 692,
      "CN(C1=O)": 693,
      "cc3)": 694,
      "N1CC": 695,
      "CCC(=O)N": 696,
      "O)=O)": 697,
      "[C@@H]1C(N": 698,
      "CCC2)=O)C": 699,
      "Cc2ccc3": 700,
      "NC(=O)[C@@H](N(C(=O)": 701,
      "NC(=O)[C@@H](N(C)C(=O)": 702,
      "NC([C@@H](N(C(": 703,
      "CC2CCCCC2)": 704,
      "NC(=O)[C@@H](N(C(": 705,
      "[C@H](CC(C)C)NC1=O)=O)": 706,
      "NC([C@@H](N(C)C(=O)": 707,
      "CC(C)C)Cc1ccccc1)": 708,
      "Cc3ccccc3)CC(=O)N": 709,
      "CN(Cc3ccccc3)C(=O)": 710,
      "[C@@H]1N(CCC1)C(=O)": 711,
      "CN(Cc3ccccc3)C(": 712,
      "cc1)=O)": 713,
      "[C@H]1[C@H](OC(=O)": 714,
      "C)=O)=O)=O)=O)": 715,
      "C(F)(F)F)": 716,
      "2)=O)=O)": 717,
      "N2[C@@H](": 718,
      "NC([C@@H](N(C)C(": 719,
      "C)=O)Cc1ccccc1": 720,
      "CC(C)C)=O)=O)=O": 721,
      "C(N[C@@H](Cc2ccccc2)C(=O)N": 722,
      "[C@H]3N(CCC3)C(=O)": 723,
      "N2[C@H](": 724,
      "[C@H]1[C@H](OC(": 725,
      "Cc1ccccc1)=O)CC(C)C": 726,
      "[C@H](C(N[C@H](C(N(": 727,
      "C(C[C@H]1": 728,
      "[C@H](N1": 729,
      "NC(=O)[C@@H](N(C)C(": 730,
      "[C@H](CC(C)C)N(C1=O)": 731,
      "C)C)C": 732,
      "CC(C)C)=O)=O)C": 733,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C(": 734,
      "[C@H](C(=O)N[C@H](C(N(": 735,
      "2[C@@H](CCC2)C(N(": 736,
      "[C@@H]3N(CCC3)C(=O)": 737,
      "(Cl)": 738,
      "[C@H]1[C@@H](C)OC(=O)": 739,
      "[C@H](C(N[C@H](C(=O)N(": 740,
      "[C@@H](CC(C)C)C(N[C@@H](Cc2ccccc2)": 741,
      "[C@@H](CC(C)C)NC1=O)=O)": 742,
      "CC(C)C)=O)CC(C)C": 743,
      "[C@H]2CCCN2C(=O)[C@@H](NC(": 744,
      "C)=O)[C@H](O)": 745,
      "C)CC(C)C)C": 746,
      "[C@@H](C)C(=O)N[C@@H](": 747,
      "C(C)(C[C@H]1": 748,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C)C(": 749,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C)C(=O)": 750,
      "CCC4)": 751,
      "Cc2ccccc2)=O)=O)": 752,
      "[C@@H](C(N[C@H](C(N": 753,
      "[C@@H]1N(C(C)=O)": 754,
      "[C@@H](C(N[C@H](C(=O)N": 755,
      "C1CC[C@@H]2": 756,
      "C(N[C@@H](Cc2ccccc2)C(N": 757,
      "[C@@H](C1=O)": 758,
      "CC(C)C)CC(C)C": 759,
      "cccc3)": 760,
      "ccc2)": 761,
      "[C@@H](NC([C@H](CC(C)C)N(C(": 762,
      "[C@@H](C(=O)N[C@H](C(N": 763,
      "C)CC(C)C)=O)C": 764,
      "[C@H](C)C": 765,
      "[C@@H](NC([C@H](CC(C)C)N(C)C(=O)": 766,
      "O)cc2)": 767,
      "C1CC[C@H]2": 768,
      "[C@H](C)C(=O)N(C)": 769,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C(=O)": 770,
      "[C@H]2CCCN2C1=O)=O)": 771,
      "CCC3)=O)=O)": 772,
      "c1ccccc1)=O)": 773,
      "[C@H](C(N[C@H](C(N(C)": 774,
      "CCC(N": 775,
      "[C@H](C(N[C@H](C(=O)N(C)": 776,
      "C)C(C)C)": 777,
      "CCCC)=O": 778,
      "[C@@H]1CC(C)C)": 779,
      "[C@H](C(=O)N[C@H](C(=O)N(": 780,
      "C)=O)C)C": 781,
      "[C@@H]3N(CCC3)C(": 782,
      "C)C)=O)CC(C)C)=O)": 783,
      "C)CC(C)C)=O)=O": 784,
      "[C@@H](C(=O)N[C@H](C(=O)N": 785,
      "C(C[C@@H]1": 786,
      "[C@H]1Cc1ccccc1)": 787,
      "C)CC(C)C)=O)CC(C)C)=O)": 788,
      "C)CC(C)C)=O)=O)=O)": 789,
      "[C@@H](C)C(N[C@@H](": 790,
      "[C@@H](NC([C@H](CC(C)C)N(C)C(": 791,
      "C(=O)N1)": 792,
      "[C@H](C)C(N(C)": 793,
      "[C@@H](C(N1)=O)": 794,
      "Cc2ccc(O)cc2)": 795,
      "[C@H](N(C1=O)": 796,
      "[C@@H]1N(C(=O)C)": 797,
      "[C@@H](CC(C)C)C(N2CCC[C@@H]2": 798,
      "CC1CCCCC1)=O)": 799,
      "[C@H](CC(C)C)C(=O)N[C@H](C(N": 800,
      "C(C)(C[C@@H]1": 801,
      "[C@@H](CC)": 802,
      "[C@@H]2N(C1=O)": 803,
      "[C@H](CC(C)C)C(=O)N[C@H](C(=O)N": 804,
      "c1cn": 805,
      "[C@H](C(=O)N[C@H](C(N(C)": 806,
      "[C@@H](NC2=O)": 807,
      "[C@H]3N(C(": 808,
      "C1CCN2": 809,
      "[C@H](C(=O)N[C@H](C(=O)N(C)": 810,
      "[C@H](CC(C)C)C(N[C@H](C(=O)N": 811,
      "[C@@H](NC([C@H](CC(C)C)N(C(=O)": 812,
      "[C@H](N(C)C1=O)": 813,
      "[C@H]3N(C(=O)": 814,
      "[C@H]1CCCN1C(C)=O)=O)": 815,
      "C)=O)=O)CC(C)C)": 816,
      "[C@@H](NC1=O)Cc1ccccc1)=O)": 817,
      "Cc1cc2": 818,
      "[C@H](CC(C)C)C(N[C@H](C(N": 819,
      "[C@H]1N(CCC1)C(": 820,
      "4CCC": 821,
      "[C@@H]1CC(C)C)=O)=O)": 822,
      "[C@@H](NC([C@H](NC(=O)": 823,
      "[C@@H]3N(C(": 824,
      "ccccc3": 825,
      "(C)": 826,
      "[C@@H](CC(C)C)C(=O)N2CCC[C@@H]2": 827,
      "C)C(C)C)=O)": 828,
      "CCC2)C": 829,
      "[C@@H](NC(=O)[C@H](NC(=O)": 830,
      "CC(C)C)=O)Cc1ccccc1)": 831,
      "CC(N[C@@H](": 832,
      "[C@H](CC)": 833,
      "CC(N[C@H](C(N(": 834,
      "[C@H]3N(CCC3)C(": 835,
      "C)[C@H](O)": 836,
      "C(O[C@@H]([C@H](NC(=O)": 837,
      "Cc2ccc(cc2)O)": 838,
      "2[C@@H](C(N": 839,
      "[C@@H]2CCCN2C1=O)=O)": 840,
      "(=O)": 841,
      "[C@@H](CC(C)C)C1=O)": 842,
      "cccc2)": 843,
      "CC(C)C)=O)Cc1ccccc1)=O)": 844,
      "CCCCCC": 845,
      "[C@H]1Cc1ccccc1)=O)": 846,
      "C)C)=O)=O)=O)": 847,
      "C)Cc1ccccc1": 848,
      "CC(N[C@H](C(=O)N(": 849,
      "[C@H]1CC(C)C)": 850,
      "C)C)=O)C": 851,
      "CC(C)C)C)=O)=O": 852,
      "[C@@H]1C(N(": 853,
      "[C@@H]2N1": 854,
      "CC(C)C)C)=O)CC(C)C)=O)": 855,
      "C(O[C@H](C)[C@H](NC(=O)": 856,
      "[C@@H](NC([C@H](NC(": 857,
      "cs": 858,
      "N1)=O)=O)": 859,
      "[C@@H]1C(=O)N(": 860,
      "[C@@H](NC(=O)CN(C(=O)": 861,
      "CCC2)=O)=O": 862,
      "C(=O)O[C@H](C)[C@H](NC(": 863,
      "[C@H]1CC(C)C)=O)=O)": 864,
      "[C@H]2N(C1=O)": 865,
      "2[C@@H]1": 866,
      "[C@@H](NC(=O)[C@H](NC(": 867,
      "[C@@H](NC(=O)CN(C(": 868,
      "CC(N1)=O)": 869,
      "[C@@H]3N(C(=O)": 870,
      "C(=O)O[C@@H]([C@H](NC(": 871,
      "[C@@H](CC(C)C)C(N1": 872,
      "2[C@H](C(=O)N": 873,
      "C(O[C@@H]([C@H](NC(": 874,
      "Cn": 875,
      "[C@@H](CC(C)C)C(=O)N1)": 876,
      "C(=O)O[C@@H]([C@H](NC(=O)": 877,
      "[C@H]1(NC(=O)": 878,
      "CC(C)C)C)=O)C": 879,
      "C)=O)CC": 880,
      "C)=O)C(C)C)": 881,
      "=O)=O)C": 882,
      "[C@H]1NC(=O)": 883,
      "CC(=O)N1)": 884,
      "2[C@H](CCC2)C(=O)N": 885,
      "2[C@H](C(N": 886,
      "C)C(C)C": 887,
      "O=C(": 888,
      "C(=O)O[C@H](C)[C@H](NC(=O)": 889,
      "[C@H]1N(C(=O)C)CCC1)": 890,
      "Cc3ccc(": 891,
      "(C[C@@H]2NC(": 892,
      "[C@H](Cc4ccccc4)": 893,
      "Cc3cc": 894,
      "C)Cc1ccccc1)=O)=O)": 895,
      "[C@@H](NC(CN(C(": 896,
      "[C@H](C(C)C)NC(=O)": 897,
      "[C@H](C(C)C)NC(": 898,
      "N(C1)": 899,
      "C1(=O)N(C)": 900,
      "[C@@H](CC(C)C)C(N1)=O)": 901,
      "CCCC)=O)=O)": 902,
      "C1N(": 903,
      "CN(CC)": 904,
      "N1(C)C(=O)": 905,
      "[C@H]1NC(": 906,
      "2[C@@H](CCC2)C(N": 907,
      "2CCCN1": 908,
      ")=O)": 909,
      "C[C@H](Cc3ccccc3)NC(=O)": 910,
      "c1(C[C@H]2": 911,
      "CN(CCCCC)": 912,
      "OCOc2": 913,
      "[C@@H]([C@@H](C)CC)": 914,
      "[C@@H](NC(CN(C(=O)": 915,
      "N1(C)C(": 916,
      "CC)C": 917,
      "CN(CCCOC(C)C)": 918,
      "CC(C)C)C)C": 919,
      "O1": 920,
      "Cc2cccc": 921,
      "CCC2)=O)CC(C)C)=O)": 922,
      "C)C(=O)N": 923,
      "[C@@H](C)O)C(=O)N(": 924,
      "[C@H]2N1": 925,
      "C[C@H](Cc3ccccc3)NC(": 926,
      "cccn": 927,
      "[C@H]2CCCN2C1=O)": 928,
      "c1c(C[C@H]2": 929,
      "OCOc3": 930,
      "[C@H]1N(C(C)=O)CCC1)": 931,
      "N(CC1)": 932,
      "N(C)C2=O)": 933,
      "2[C@@H](CCC2)C(=O)N": 934,
      "OCO3)": 935,
      "CS": 936,
      "[C@@H](CC(C)C)C(=O)N1": 937,
      "c1cc(C[C@H]2": 938,
      "[C@H](C(N[C@@H]([C@H](O)C)": 939,
      "c1ccc(C[C@H]2": 940,
      "C1C[C@H]2": 941,
      "[C@@H]([C@H](CC)C)": 942,
      "c1cccc(C[C@H]2": 943,
      "C1(N(C)": 944,
      "NC2=O)=O)": 945,
      "CC(C)C)CCC2)": 946,
      "[C@@H](CC(C)C)N1": 947,
      "2CCC[C@H]1": 948,
      "[C@H]1(NC(": 949,
      "C(=O)N(C)[C@H](C(=O)N": 950,
      "CC(=O)N[C@H](C(=O)N(": 951,
      "(C[C@@H]2NC(=O)": 952,
      "[C@H](Cc2ccccc2)NC1=O)=O)": 953,
      "CC1)=O)": 954,
      "C)C)=O)=O": 955,
      "[C@@H](CC(C)C)NC1=O)": 956,
      "C(O[C@H](C)[C@H](NC(": 957,
      "Cc1ccccc1)=O)Cc1ccccc1)=O)": 958,
      "CC(=O)N[C@@H](Cc2ccccc2)": 959,
      "2[C@H](CCC2)C(N": 960,
      "[C@H]2CCCN2C([C@@H](NC(": 961,
      "[C@@H]1(Cc2ccccc2)": 962,
      "C)=O)CC(C)C)C": 963,
      "C)(C)C": 964,
      "[C@@H](Cc2ccccc2)C(=O)N[C@@H](": 965,
      "C)=O)Cc1ccccc1)=O": 966,
      "c1ccccc1C[C@H]1": 967,
      "C(c1ccccc1)[C@H]1": 968,
      "[C@H](CC(C)C)NC1=O)": 969,
      "C)=O)=O)CC(C)C": 970,
      "C)CC(C)C)CC(C)C)=O)": 971,
      "CC(C)C)=O)=O)CC(C)C)=O)": 972,
      "[C@@H](CC(C)C)C(N2CCC[C@H]2": 973,
      "C2=O)=O)=O)": 974,
      "[C@@H](C)O)C(N(": 975,
      "CCCCN)": 976,
      "Cc1ccccc1)CC(C)C": 977,
      "2[C@@H](C(=O)N": 978,
      "[C@H]1CC(C)C)C)=O)": 979,
      "NC([C@@H](NC(=O)": 980,
      "CN(CCC": 981,
      "c1ccc(C[C@@H]2": 982,
      "[C@@H](CC(C)C)C(=O)N2CCC[C@H]2": 983,
      "[C@H]2CCCN2C(=O)[C@@H](NC(=O)": 984,
      "CCCCC": 985,
      "CC(=O)N[C@H](C(N(": 986,
      "C(=O)N(C)[C@H](C(N": 987,
      "[C@@H](C(=O)N1": 988,
      "[C@H]2CCCN2C([C@@H](NC(=O)": 989,
      "3CCC[C@@H]3C(=O)N(": 990,
      "[C@H]1N(CCC1)C(C)=O)=O)": 991,
      "c2ccccc2": 992,
      "[C@@H](NC1=O)Cc1ccccc1)": 993,
      "[C@H]1N(C(=O)C)CCC1)=O)": 994,
      "[C@H](O": 995,
      "O)cc1)": 996,
      "c1c(C[C@@H]2": 997,
      "C)C(N": 998,
      "CC(C)C)CC(C)C)=O": 999
    },
    "merges": [
      [
        "C",
        "("
      ],
      [
        "C",
        ")"
      ],
      [
        "=",
        "O"
      ],
      [
        "=O",
        ")"
      ],
      [
        "H",
        "]"
      ],
      [
        "C",
        "@"
      ],
      [
        "[",
        "C@"
      ],
      [
        "H]",
        "("
      ],
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "C(",
        "=O)"
      ],
      [
        "C)",
        "C)"
      ],
      [
        "N",
        "("
      ],
      [
        "[C@",
        "H]("
      ],
      [
        "[C@@",
        "H]("
      ],
      [
        "C",
        "C("
      ],
      [
        "CC(",
        "C)C)"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c",
        "1"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "N(",
        "C)"
      ],
      [
        "C(",
        "N"
      ],
      [
        "2",
        ")"
      ],
      [
        "=O)",
        "=O)"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "N",
        "C("
      ],
      [
        "C",
        "1"
      ],
      [
        "C)",
        "=O)"
      ],
      [
        "[C@@H](",
        "CC(C)C)"
      ],
      [
        "[C@H](",
        "CC(C)C)"
      ],
      [
        "c1",
        "cccc"
      ],
      [
        "C",
        "c"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "cccc",
        "c"
      ],
      [
        "CCC",
        "2)"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "CC(C)C)",
        "=O)"
      ],
      [
        "2",
        "CCC"
      ],
      [
        "Cc1ccccc1",
        ")"
      ],
      [
        "Cc",
        "2"
      ],
      [
        "1",
        ")"
      ],
      [
        "N(",
        "C(=O)"
      ],
      [
        "N(",
        "C("
      ],
      [
        "ccccc",
        "2)"
      ],
      [
        "Cc2",
        "ccccc2)"
      ],
      [
        "[C@@H](",
        "C)"
      ],
      [
        "[C@@H]",
        "1"
      ],
      [
        "[C@H]",
        "1"
      ],
      [
        "C(=O)",
        "N("
      ],
      [
        "N",
        "1"
      ],
      [
        "C(",
        "N("
      ],
      [
        "N",
        "2"
      ],
      [
        "[C@H](",
        "C(=O)N"
      ],
      [
        "[C@H](",
        "C(N"
      ],
      [
        "C)",
        "C"
      ],
      [
        "N(C)",
        "C("
      ],
      [
        "[C@@H]",
        "2"
      ],
      [
        "N(C)",
        "C(=O)"
      ],
      [
        "[C@H]",
        "2"
      ],
      [
        "C(=O)",
        "N(C)"
      ],
      [
        "3",
        ")"
      ],
      [
        "[C@H](",
        "C)"
      ],
      [
        "2CCC",
        "N2"
      ],
      [
        "[C@@H](",
        "NC(=O)"
      ],
      [
        "[C@@H](",
        "NC("
      ],
      [
        "C(",
        "N(C)"
      ],
      [
        "C)",
        "=O)=O)"
      ],
      [
        "O",
        ")"
      ],
      [
        "C1",
        "=O)"
      ],
      [
        "Cc1ccccc1)",
        "=O)"
      ],
      [
        "C(",
        "C)C)"
      ],
      [
        "C(=O)N",
        "[C@@H]("
      ],
      [
        "CC(",
        "C)C"
      ],
      [
        "C)",
        "CC(C)C)"
      ],
      [
        "CCC",
        "1)"
      ],
      [
        "C(N",
        "[C@@H]("
      ],
      [
        "[C@H](",
        "Cc2ccccc2)"
      ],
      [
        "c",
        "("
      ],
      [
        "CCC2)",
        "=O)"
      ],
      [
        "Cc",
        "3"
      ],
      [
        "O",
        "="
      ],
      [
        "[C@H]",
        "2CCCN2"
      ],
      [
        "N(",
        "CCC2)"
      ],
      [
        "[C@@H]",
        "2CCCN2"
      ],
      [
        "CC(",
        "N"
      ],
      [
        "[C@H](",
        "NC(=O)"
      ],
      [
        "ccccc",
        "3)"
      ],
      [
        "CC(C)C)",
        "=O)=O)"
      ],
      [
        "C)C)",
        "=O)"
      ],
      [
        "[C@H](",
        "NC("
      ],
      [
        "Cc3",
        "ccccc3)"
      ],
      [
        "C1",
        "("
      ],
      [
        "2CCC",
        "[C@@H]2"
      ],
      [
        "O=",
        "C1"
      ],
      [
        "C",
        "N("
      ],
      [
        "C)",
        "CC(C)C)=O)"
      ],
      [
        "2CCC",
        "[C@H]2"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N"
      ],
      [
        "CCC",
        "3)"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N"
      ],
      [
        "C",
        "C(=O)N"
      ],
      [
        "1",
        "CC"
      ],
      [
        "1)",
        "=O)"
      ],
      [
        "C)",
        "=O"
      ],
      [
        "2",
        "[C@@H]("
      ],
      [
        "O",
        "C("
      ],
      [
        "3",
        "CCC"
      ],
      [
        "C1",
        "=O)=O)"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "C)",
        "("
      ],
      [
        "2",
        "CC"
      ],
      [
        "[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "[C@@H](",
        "N(C(=O)"
      ],
      [
        "[C@@H](",
        "N(C("
      ],
      [
        "[C@@H](",
        "N(C)C("
      ],
      [
        "[C@@H](",
        "N(C)C(=O)"
      ],
      [
        "[C@H](",
        "C(N("
      ],
      [
        "CC(C)C)",
        "C)=O)"
      ],
      [
        "[C@H](",
        "C(=O)N("
      ],
      [
        "[C@@H](",
        "C(=O)N"
      ],
      [
        "1CC",
        "CCC1)"
      ],
      [
        "[C@H](",
        "C"
      ],
      [
        "[C@@H](",
        "C(N"
      ],
      [
        "[C@H](",
        "O)"
      ],
      [
        "[C@H](CC(C)C)",
        "NC(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "NC("
      ],
      [
        "[C@@H](C)",
        "O)"
      ],
      [
        "C",
        "[C@@H]1"
      ],
      [
        "C",
        "[C@H]1"
      ],
      [
        "C1",
        ")"
      ],
      [
        "2",
        "[C@H]("
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N"
      ],
      [
        "CC(C)C)",
        "=O"
      ],
      [
        "CCC",
        "N1"
      ],
      [
        "N",
        "C1=O)"
      ],
      [
        "[C@H](",
        "C(N(C)"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "[C@H](",
        "C(=O)N(C)"
      ],
      [
        "C",
        "N1"
      ],
      [
        "[C@@H]2",
        "N(CCC2)"
      ],
      [
        "=O)=O)",
        "=O)"
      ],
      [
        "CCC",
        "C)"
      ],
      [
        "C",
        "N(C(=O)"
      ],
      [
        "[C@H]2",
        "N(CCC2)"
      ],
      [
        "C",
        "N(C("
      ],
      [
        "[C@@H](CC(C)C)",
        "NC("
      ],
      [
        "[C@@H](CC(C)C)",
        "NC(=O)"
      ],
      [
        "C1(",
        "=O)"
      ],
      [
        "C",
        "2"
      ],
      [
        "c1",
        ")"
      ],
      [
        "[C@H]2CCCN2",
        "C(=O)"
      ],
      [
        "[C@H]2CCCN2",
        "C("
      ],
      [
        "[C@@H]2CCCN2",
        "C(=O)"
      ],
      [
        "[C@@H]2CCCN2",
        "C("
      ],
      [
        "C(",
        "O"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C("
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C)C("
      ],
      [
        "[C@H](CC(C)C)",
        "N(C(=O)"
      ],
      [
        "N",
        "3"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C)C(=O)"
      ],
      [
        "C)=O)",
        "C)=O)"
      ],
      [
        "O",
        "C(=O)"
      ],
      [
        "2[C@H](",
        "CCC2)"
      ],
      [
        "3CCC",
        "N3"
      ],
      [
        "[C@@H]",
        "3"
      ],
      [
        "Cc1ccccc1)",
        "=O)=O)"
      ],
      [
        "[C@@H](C)",
        "C"
      ],
      [
        "[C@H]",
        "3"
      ],
      [
        "C)=O)",
        "CC(C)C)=O)"
      ],
      [
        "[C@H](",
        "Cc3ccccc3)"
      ],
      [
        "[C@@H]1",
        "("
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "N1",
        "("
      ],
      [
        "[C@H]1",
        "("
      ],
      [
        "2[C@@H](",
        "CCC2)"
      ],
      [
        "c",
        "2"
      ],
      [
        "F",
        ")"
      ],
      [
        "CC(",
        "N("
      ],
      [
        "[C@H](Cc2ccccc2)",
        "NC("
      ],
      [
        "2CC",
        "CCC2)"
      ],
      [
        "[C@H](",
        "N(C)C(=O)"
      ],
      [
        "OC(",
        "C)("
      ],
      [
        "[C@H](",
        "N(C(=O)"
      ],
      [
        "[C@H](Cc2ccccc2)",
        "NC(=O)"
      ],
      [
        "C)=O)",
        "CC(C)C)"
      ],
      [
        "[C@H](O)",
        "C)"
      ],
      [
        "[C@H](",
        "N(C)C("
      ],
      [
        "[C@H](",
        "N(C("
      ],
      [
        "Cc1ccccc1)",
        "=O"
      ],
      [
        "CC",
        "C)"
      ],
      [
        "[C@H](C(=O)N",
        "[C@@H]("
      ],
      [
        "Cc2",
        "cc"
      ],
      [
        "N(",
        "C1=O)"
      ],
      [
        "[C@H](C(N",
        "[C@@H]("
      ],
      [
        "N",
        "1)"
      ],
      [
        "(",
        "C"
      ],
      [
        "C)=O)=O)",
        "=O)"
      ],
      [
        "C2",
        "=O)"
      ],
      [
        "CC(",
        "N(C)"
      ],
      [
        "[C@@H](C)",
        "C(=O)N"
      ],
      [
        "[C@@H](C)",
        "C(N"
      ],
      [
        "C(=O)N[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "C(",
        "C)("
      ],
      [
        "cc",
        "1)"
      ],
      [
        "1CCCCC1)",
        "=O)"
      ],
      [
        "C",
        "C(=O)N("
      ],
      [
        "[C@H](C",
        "C)C)"
      ],
      [
        "[C@@H]1",
        "CCCN1"
      ],
      [
        "[C@@H](",
        "NC1=O)"
      ],
      [
        "C)=O)",
        "C"
      ],
      [
        "[C@H](",
        "C(C)C)"
      ],
      [
        "2CC",
        "CCC2)=O)"
      ],
      [
        "N",
        "C1=O)=O)"
      ],
      [
        "N(",
        "CCC1)"
      ],
      [
        "C(C)C)",
        "=O)"
      ],
      [
        "OC(C)(",
        "C)C)"
      ],
      [
        "C",
        "C(=O)N(C)"
      ],
      [
        "O",
        "CC"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C(=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C("
      ],
      [
        "cc",
        "2)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C)C(=O)"
      ],
      [
        "[C@@H]2",
        "N(C(=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C)C("
      ],
      [
        "O=C1",
        "N"
      ],
      [
        "[C@@H]2",
        "N(C("
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N[C@@H]("
      ],
      [
        "[C@H]2",
        "N(C(=O)"
      ],
      [
        "[C@@H]2N(CCC2)",
        "C("
      ],
      [
        "C1",
        "CC"
      ],
      [
        "[C@@H]2N(CCC2)",
        "C(=O)"
      ],
      [
        "[C@H]2",
        "N(C("
      ],
      [
        "[C@H]2N(CCC2)",
        "C("
      ],
      [
        "C)CC(C)C)",
        "=O)=O)"
      ],
      [
        "C(",
        "C)C"
      ],
      [
        "CC(C)C)=O)",
        "CC(C)C)=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N("
      ],
      [
        "CC(C)C)",
        "C"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N("
      ],
      [
        "[C@H]2N(CCC2)",
        "C(=O)"
      ],
      [
        "CN(",
        "Cc2ccccc2)"
      ],
      [
        "[C@H](C)",
        "NC(=O)"
      ],
      [
        "CCC3)",
        "=O)"
      ],
      [
        "c",
        "2)"
      ],
      [
        "[C@H](C)",
        "NC("
      ],
      [
        "C1)",
        "=O)"
      ],
      [
        "C)=O)",
        "C)"
      ],
      [
        "[C@@H](C)C",
        "C)"
      ],
      [
        "CC(C)C)",
        "C)"
      ],
      [
        "[C@@H]",
        "3CCCN3"
      ],
      [
        "C)C)",
        "=O)=O)"
      ],
      [
        "[C@H](",
        "CCCC)"
      ],
      [
        "c1",
        "c("
      ],
      [
        "1)",
        "=O)=O)"
      ],
      [
        "2)",
        "=O)"
      ],
      [
        "N(",
        "CCC3)"
      ],
      [
        "[C@H]",
        "3CCCN3"
      ],
      [
        "[C@H](",
        "OC(=O)"
      ],
      [
        "O",
        "C"
      ],
      [
        "[C@H](",
        "OC("
      ],
      [
        "[C@@H](C)",
        "OC("
      ],
      [
        "C(=O)N",
        "[C@H](C(N"
      ],
      [
        "CCC",
        "2"
      ],
      [
        "[C@@H](C)",
        "OC(=O)"
      ],
      [
        "C(N",
        "[C@H](C(N"
      ],
      [
        "C(=O)N",
        "[C@H](C(=O)N"
      ],
      [
        "C)=O)",
        "=O"
      ],
      [
        "[C@@H](",
        "C(N("
      ],
      [
        "[C@H]1",
        "CCCN1"
      ],
      [
        "[C@@H](",
        "C(=O)N("
      ],
      [
        "C(N",
        "[C@H](C(=O)N"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N(C)"
      ],
      [
        "[C@@H](",
        "C(C)C)"
      ],
      [
        "3CCC",
        "[C@@H]3"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N(C)"
      ],
      [
        "C(N[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "c1ccccc1",
        ")"
      ],
      [
        "C1",
        "C"
      ],
      [
        "Cc2cc",
        "c("
      ],
      [
        "C(",
        "C(C)C)"
      ],
      [
        "c1ccc(",
        "cc1)"
      ],
      [
        "3CCC",
        "[C@H]3"
      ],
      [
        "CCC2)",
        "=O)=O)"
      ],
      [
        "CC(C)C",
        "[C@H]1"
      ],
      [
        "N1",
        "C("
      ],
      [
        "C(N",
        "1"
      ],
      [
        "N1",
        "C(=O)"
      ],
      [
        "c",
        "3"
      ],
      [
        "CC(C)C",
        "[C@@H]1"
      ],
      [
        "C(",
        "C)=O)=O)"
      ],
      [
        "CC(",
        "C[C@@H]1"
      ],
      [
        "CC(",
        "C[C@H]1"
      ],
      [
        "CC(C)C)",
        "CC(C)C)=O)"
      ],
      [
        "CC(C)C)=O)=O)",
        "=O)"
      ],
      [
        "C(",
        "[C@H]1"
      ],
      [
        "[C@H](",
        "C1=O)"
      ],
      [
        "4",
        ")"
      ],
      [
        "N(C)",
        "C1=O)"
      ],
      [
        "Cc2ccccc2)",
        "=O)"
      ],
      [
        "C)CC(C)C)",
        "=O"
      ],
      [
        "CC(C)C)",
        "C)=O)=O)"
      ],
      [
        "C(",
        "[C@@H]1"
      ],
      [
        "[C@H](",
        "[C@H](O)C)"
      ],
      [
        "[C@H](",
        "[C@@H](C)O)"
      ],
      [
        "CCC2)",
        "=O"
      ],
      [
        "OC",
        "O"
      ],
      [
        "l",
        ")"
      ],
      [
        "C",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](",
        "C(N(C)"
      ],
      [
        "C)",
        "Cc1ccccc1)"
      ],
      [
        "2CCC[C@@H]2",
        "C(N("
      ],
      [
        "C)",
        "CC(C)C"
      ],
      [
        "C)",
        "Cc1ccccc1)=O)"
      ],
      [
        "2CCC[C@@H]2",
        "C(=O)N("
      ],
      [
        "[C@H](C)",
        "N(C)C("
      ],
      [
        "C(O",
        "[C@@H]("
      ],
      [
        "c",
        "n"
      ],
      [
        "[C@H](C)",
        "N(C)C(=O)"
      ],
      [
        "C(=O)O",
        "[C@@H]("
      ],
      [
        "C(=O)O",
        "[C@H](C)"
      ],
      [
        "CC(C)C)=O)",
        "C"
      ],
      [
        "[C@@H](",
        "C(=O)N(C)"
      ],
      [
        "[C@@H](Cc2ccccc2)",
        "C(=O)N"
      ],
      [
        "[C@H](Cc3ccccc3)",
        "NC(=O)"
      ],
      [
        "C(O",
        "[C@H](C)"
      ],
      [
        "[C@@H]1CCCN1",
        "C(=O)"
      ],
      [
        "[C@@H](C)O)",
        "=O)"
      ],
      [
        "[C@@H](",
        "N1)"
      ],
      [
        "[C@H]1",
        "N(CCC1)"
      ],
      [
        "CC",
        "1"
      ],
      [
        "[C@H](C)",
        "N(C(=O)"
      ],
      [
        "[C@@H](Cc2ccccc2)",
        "C(N"
      ],
      [
        "C(N",
        "1CCCCC1)"
      ],
      [
        "CN(",
        "CCC)"
      ],
      [
        "[C@H](Cc3ccccc3)",
        "NC("
      ],
      [
        "C)=O)",
        "Cc1ccccc1)"
      ],
      [
        "C",
        "OC(C)(C)C)"
      ],
      [
        "(",
        "cc"
      ],
      [
        "[C@H](C(=O)N",
        "[C@H](C(=O)N"
      ],
      [
        "C",
        "C)"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "N(C(=O)",
        "C)"
      ],
      [
        "[C@H](C)",
        "N(C("
      ],
      [
        "CCC",
        "1"
      ],
      [
        "C[C@@H]1",
        "NC(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N("
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N("
      ],
      [
        "N1(",
        "C)"
      ],
      [
        "N(C(",
        "C)=O)"
      ],
      [
        "C)=O)",
        "Cc1ccccc1)=O)"
      ],
      [
        "[C@H](C(N",
        "[C@H](C(N"
      ],
      [
        "CC(C)C)=O)",
        "=O"
      ],
      [
        "[C@H](",
        "NC1=O)"
      ],
      [
        "C(C)(",
        "C)C"
      ],
      [
        "C1(=O)",
        "N"
      ],
      [
        "[C@H](C(N",
        "[C@H](C(=O)N"
      ],
      [
        "C2",
        "=O)=O)"
      ],
      [
        "C1(",
        "N"
      ],
      [
        "[C@H](C)",
        "C(=O)N"
      ],
      [
        "C[C@@H]1",
        "NC("
      ],
      [
        "C)C)",
        "=O"
      ],
      [
        "C",
        "[C@H](NC(=O)"
      ],
      [
        "C",
        "[C@H](NC("
      ],
      [
        "[C@@H](C)",
        "NC("
      ],
      [
        "CCC1)",
        "=O)"
      ],
      [
        "CC(C)C)=O)",
        "CC(C)C)"
      ],
      [
        "cc",
        "1"
      ],
      [
        "CN(",
        "CC"
      ],
      [
        "C)=O)",
        "C)CC(C)C)=O)"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "C",
        "[C@@H](C(=O)N"
      ],
      [
        "[C@H](C)",
        "C(N"
      ],
      [
        "C)",
        "NC(=O)"
      ],
      [
        "[C@@H](C)",
        "C(=O)N("
      ],
      [
        "C",
        "[C@@H](NC(=O)"
      ],
      [
        "C)",
        "NC("
      ],
      [
        "[C@@H](",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](C)",
        "C(N("
      ],
      [
        "[C@H](C(=O)N",
        "[C@H](C(N"
      ],
      [
        "C",
        "[C@@H](NC("
      ],
      [
        "C",
        "[C@@H](C(N"
      ],
      [
        "2CCC[C@H]2",
        "C(N("
      ],
      [
        "C(=O)N",
        "1"
      ],
      [
        "[C@@H](C)",
        "NC(=O)"
      ],
      [
        "[C@@H](",
        "C(N[C@@H]("
      ],
      [
        "C(=O)N",
        "1CCCCC1)"
      ],
      [
        "C)=O)",
        "C)CC(C)C)"
      ],
      [
        "2CCC[C@H]2",
        "C(=O)N("
      ],
      [
        "CN1",
        "C(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N(C)"
      ],
      [
        "CN1",
        "C("
      ],
      [
        "CC(",
        "N2"
      ],
      [
        "CC(C)C)",
        "C)=O"
      ],
      [
        "C",
        "l)"
      ],
      [
        "CCCO",
        "C(C)C)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N(C)"
      ],
      [
        "CC",
        "1)"
      ],
      [
        "C)=O)",
        "CCC2)=O)"
      ],
      [
        "CN(",
        "Cc3ccccc3)"
      ],
      [
        "C)=O)",
        "CC(C)C"
      ],
      [
        "CN(Cc2ccccc2)",
        "C("
      ],
      [
        "(",
        "C)C"
      ],
      [
        "(",
        "c1)"
      ],
      [
        "2",
