{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Strip",
    "strip_left": false,
    "strip_right": true
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          1
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "(": 4,
      ")": 5,
      "+": 6,
      "-": 7,
      "/": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "=": 15,
      "@": 16,
      "B": 17,
      "C": 18,
      "F": 19,
      "H": 20,
      "N": 21,
      "O": 22,
      "S": 23,
      "[": 24,
      "\\": 25,
      "]": 26,
      "c": 27,
      "l": 28,
      "n": 29,
      "o": 30,
      "r": 31,
      "s": 32,
      "C(": 33,
      "C)": 34,
      "=O": 35,
      "=O)": 36,
      "H]": 37,
      "C@": 38,
      "[C@": 39,
      "H](": 40,
      "cc": 41,
      "CC": 42,
      "[C@@": 43,
      "C(=O)": 44,
      "C)C)": 45,
      "N(": 46,
      "[C@H](": 47,
      "[C@@H](": 48,
      "CC(": 49,
      "CC(C)C)": 50,
      "CCC": 51,
      "c1": 52,
      "cccc": 53,
      "C(=O)N": 54,
      "N(C)": 55,
      "C(N": 56,
      "2)": 57,
      "=O)=O)": 58,
      "[C@@H]": 59,
      "[C@H]": 60,
      "NC(=O)": 61,
      "NC(": 62,
      "C1": 63,
      "C)=O)": 64,
      "[C@@H](CC(C)C)": 65,
      "[C@H](CC(C)C)": 66,
      "c1cccc": 67,
      "Cc": 68,
      "c1ccccc1": 69,
      "ccccc": 70,
      "CCC2)": 71,
      "Cc1ccccc1": 72,
      "CC(C)C)=O)": 73,
      "2CCC": 74,
      "Cc1ccccc1)": 75,
      "Cc2": 76,
      "1)": 77,
      "N(C(=O)": 78,
      "N(C(": 79,
      "ccccc2)": 80,
      "Cc2ccccc2)": 81,
      "[C@@H](C)": 82,
      "[C@@H]1": 83,
      "[C@H]1": 84,
      "C(=O)N(": 85,
      "N1": 86,
      "C(N(": 87,
      "N2": 88,
      "[C@H](C(=O)N": 89,
      "[C@H](C(N": 90,
      "C)C": 91,
      "N(C)C(": 92,
      "[C@@H]2": 93,
      "N(C)C(=O)": 94,
      "[C@H]2": 95,
      "C(=O)N(C)": 96,
      "3)": 97,
      "[C@H](C)": 98,
      "2CCCN2": 99,
      "[C@@H](NC(=O)": 100,
      "[C@@H](NC(": 101,
      "C(N(C)": 102,
      "C)=O)=O)": 103,
      "O)": 104,
      "C1=O)": 105,
      "Cc1ccccc1)=O)": 106,
      "C(C)C)": 107,
      "C(=O)N[C@@H](": 108,
      "CC(C)C": 109,
      "C)CC(C)C)": 110,
      "CCC1)": 111,
      "C(N[C@@H](": 112,
      "[C@H](Cc2ccccc2)": 113,
      "c(": 114,
      "CCC2)=O)": 115,
      "Cc3": 116,
      "O=": 117,
      "[C@H]2CCCN2": 118,
      "N(CCC2)": 119,
      "[C@@H]2CCCN2": 120,
      "CC(N": 121,
      "[C@H](NC(=O)": 122,
      "ccccc3)": 123,
      "CC(C)C)=O)=O)": 124,
      "C)C)=O)": 125,
      "[C@H](NC(": 126,
      "Cc3ccccc3)": 127,
      "C1(": 128,
      "2CCC[C@@H]2": 129,
      "O=C1": 130,
      "CN(": 131,
      "C)CC(C)C)=O)": 132,
      "2CCC[C@H]2": 133,
      "[C@@H](CC(C)C)C(N": 134,
      "CCC3)": 135,
      "[C@@H](CC(C)C)C(=O)N": 136,
      "CC(=O)N": 137,
      "1CC": 138,
      "1)=O)": 139,
      "C)=O": 140,
      "2[C@@H](": 141,
      "OC(": 142,
      "3CCC": 143,
      "C1=O)=O)": 144,
      "c1cc": 145,
      "C)(": 146,
      "2CC": 147,
      "[C@@H](Cc2ccccc2)": 148,
      "[C@@H](N(C(=O)": 149,
      "[C@@H](N(C(": 150,
      "[C@@H](N(C)C(": 151,
      "[C@@H](N(C)C(=O)": 152,
      "[C@H](C(N(": 153,
      "CC(C)C)C)=O)": 154,
      "[C@H](C(=O)N(": 155,
      "[C@@H](C(=O)N": 156,
      "1CCCCC1)": 157,
      "[C@H](C": 158,
      "[C@@H](C(N": 159,
      "[C@H](O)": 160,
      "[C@H](CC(C)C)NC(=O)": 161,
      "[C@H](CC(C)C)NC(": 162,
      "[C@@H](C)O)": 163,
      "C[C@@H]1": 164,
      "C[C@H]1": 165,
      "C1)": 166,
      "2[C@H](": 167,
      "[C@H](CC(C)C)C(=O)N": 168,
      "[C@H](CC(C)C)C(N": 169,
      "CC(C)C)=O": 170,
      "CCCN1": 171,
      "NC1=O)": 172,
      "[C@H](C(N(C)": 173,
      "CCCC": 174,
      "[C@H](C(=O)N(C)": 175,
      "CN1": 176,
      "[C@@H]2N(CCC2)": 177,
      "=O)=O)=O)": 178,
      "CCCC)": 179,
      "CN(C(=O)": 180,
      "[C@H]2N(CCC2)": 181,
      "CN(C(": 182,
      "[C@@H](CC(C)C)NC(": 183,
      "[C@@H](CC(C)C)NC(=O)": 184,
      "C1(=O)": 185,
      "C2": 186,
      "c1)": 187,
      "[C@H]2CCCN2C(=O)": 188,
      "[C@H]2CCCN2C(": 189,
      "[C@@H]2CCCN2C(=O)": 190,
      "[C@@H]2CCCN2C(": 191,
      "C(O": 192,
      "[C@H](CC(C)C)N(C(": 193,
      "C(=O)O": 194,
      "[C@H](CC(C)C)N(C)C(": 195,
      "[C@H](CC(C)C)N(C(=O)": 196,
      "N3": 197,
      "[C@H](CC(C)C)N(C)C(=O)": 198,
      "C)=O)C)=O)": 199,
      "OC(=O)": 200,
      "2[C@H](CCC2)": 201,
      "3CCCN3": 202,
      "[C@@H]3": 203,
      "Cc1ccccc1)=O)=O)": 204,
      "[C@@H](C)C": 205,
      "[C@H]3": 206,
      "C)=O)CC(C)C)=O)": 207,
      "[C@H](Cc3ccccc3)": 208,
      "[C@@H]1(": 209,
      "c1ccc(": 210,
      "N1(": 211,
      "[C@H]1(": 212,
      "2[C@@H](CCC2)": 213,
      "c2": 214,
      "F)": 215,
      "CC(N(": 216,
      "[C@H](Cc2ccccc2)NC(": 217,
      "2CCCCC2)": 218,
      "[C@H](N(C)C(=O)": 219,
      "OC(C)(": 220,
      "[C@H](N(C(=O)": 221,
      "[C@H](Cc2ccccc2)NC(=O)": 222,
      "C)=O)CC(C)C)": 223,
      "[C@H](O)C)": 224,
      "[C@H](N(C)C(": 225,
      "[C@H](N(C(": 226,
      "Cc1ccccc1)=O": 227,
      "CCC)": 228,
      "[C@H](C(=O)N[C@@H](": 229,
      "Cc2cc": 230,
      "N(C1=O)": 231,
      "[C@H](C(N[C@@H](": 232,
      "N1)": 233,
      "(C": 234,
      "C)=O)=O)=O)": 235,
      "C2=O)": 236,
      "CC(N(C)": 237,
      "[C@@H](C)C(=O)N": 238,
      "[C@@H](C)C(N": 239,
      "C(=O)N[C@@H](Cc2ccccc2)": 240,
      "C(C)(": 241,
      "cc1)": 242,
      "1CCCCC1)=O)": 243,
      "CC(=O)N(": 244,
      "[C@H](CC)C)": 245,
      "[C@@H]1CCCN1": 246,
      "[C@@H](NC1=O)": 247,
      "C)=O)C": 248,
      "[C@H](C(C)C)": 249,
      "2CCCCC2)=O)": 250,
      "NC1=O)=O)": 251,
      "N(CCC1)": 252,
      "C(C)C)=O)": 253,
      "OC(C)(C)C)": 254,
      "CC(=O)N(C)": 255,
      "OCC": 256,
      "[C@@H](CC(C)C)N(C(=O)": 257,
      "[C@@H](CC(C)C)N(C(": 258,
      "cc2)": 259,
      "[C@@H](CC(C)C)N(C)C(=O)": 260,
      "[C@@H]2N(C(=O)": 261,
      "[C@@H](CC(C)C)N(C)C(": 262,
      "O=C1N": 263,
      "[C@@H]2N(C(": 264,
      "[C@@H](CC(C)C)C(N[C@@H](": 265,
      "[C@H]2N(C(=O)": 266,
      "[C@@H]2N(CCC2)C(": 267,
      "C1CC": 268,
      "[C@@H]2N(CCC2)C(=O)": 269,
      "[C@H]2N(C(": 270,
      "[C@H]2N(CCC2)C(": 271,
      "C)CC(C)C)=O)=O)": 272,
      "C(C)C": 273,
      "CC(C)C)=O)CC(C)C)=O)": 274,
      "[C@@H](CC(C)C)C(N(": 275,
      "CC(C)C)C": 276,
      "[C@@H](CC(C)C)C(=O)N(": 277,
      "[C@H]2N(CCC2)C(=O)": 278,
      "CN(Cc2ccccc2)": 279,
      "[C@H](C)NC(=O)": 280,
      "CCC3)=O)": 281,
      "c2)": 282,
      "[C@H](C)NC(": 283,
      "C1)=O)": 284,
      "C)=O)C)": 285,
      "[C@@H](C)CC)": 286,
      "CC(C)C)C)": 287,
      "[C@@H]3CCCN3": 288,
      "C)C)=O)=O)": 289,
      "[C@H](CCCC)": 290,
      "c1c(": 291,
      "1)=O)=O)": 292,
      "2)=O)": 293,
      "N(CCC3)": 294,
      "[C@H]3CCCN3": 295,
      "[C@H](OC(=O)": 296,
      "OC": 297,
      "[C@H](OC(": 298,
      "[C@@H](C)OC(": 299,
      "C(=O)N[C@H](C(N": 300,
      "CCC2": 301,
      "[C@@H](C)OC(=O)": 302,
      "C(N[C@H](C(N": 303,
      "C(=O)N[C@H](C(=O)N": 304,
      "C)=O)=O": 305,
      "[C@@H](C(N(": 306,
      "[C@H]1CCCN1": 307,
      "[C@@H](C(=O)N(": 308,
      "C(N[C@H](C(=O)N": 309,
      "[C@@H](CC(C)C)C(N(C)": 310,
      "[C@@H](C(C)C)": 311,
      "3CCC[C@@H]3": 312,
      "[C@@H](CC(C)C)C(=O)N[C@@H](": 313,
      "[C@@H](CC(C)C)C(=O)N(C)": 314,
      "C(N[C@@H](Cc2ccccc2)": 315,
      "c1ccccc1)": 316,
      "C1C": 317,
      "Cc2ccc(": 318,
      "C(C(C)C)": 319,
      "c1ccc(cc1)": 320,
      "3CCC[C@H]3": 321,
      "CCC2)=O)=O)": 322,
      "CC(C)C[C@H]1": 323,
      "N1C(": 324,
      "C(N1": 325,
      "N1C(=O)": 326,
      "c3": 327,
      "CC(C)C[C@@H]1": 328,
      "C(C)=O)=O)": 329,
      "CC(C[C@@H]1": 330,
      "CC(C[C@H]1": 331,
      "CC(C)C)CC(C)C)=O)": 332,
      "CC(C)C)=O)=O)=O)": 333,
      "C([C@H]1": 334,
      "[C@H](C1=O)": 335,
      "4)": 336,
      "N(C)C1=O)": 337,
      "Cc2ccccc2)=O)": 338,
      "C)CC(C)C)=O": 339,
      "CC(C)C)C)=O)=O)": 340,
      "C([C@@H]1": 341,
      "[C@H]([C@H](O)C)": 342,
      "[C@H]([C@@H](C)O)": 343,
      "CCC2)=O": 344,
      "OCO": 345,
      "l)": 346,
      "CC(=O)N[C@@H](": 347,
      "[C@@H](C(N(C)": 348,
      "C)Cc1ccccc1)": 349,
      "2CCC[C@@H]2C(N(": 350,
      "C)CC(C)C": 351,
      "C)Cc1ccccc1)=O)": 352,
      "2CCC[C@@H]2C(=O)N(": 353,
      "[C@H](C)N(C)C(": 354,
      "C(O[C@@H](": 355,
      "cn": 356,
      "[C@H](C)N(C)C(=O)": 357,
      "C(=O)O[C@@H](": 358,
      "C(=O)O[C@H](C)": 359,
      "CC(C)C)=O)C": 360,
      "[C@@H](C(=O)N(C)": 361,
      "[C@@H](Cc2ccccc2)C(=O)N": 362,
      "[C@H](Cc3ccccc3)NC(=O)": 363,
      "C(O[C@H](C)": 364,
      "[C@@H]1CCCN1C(=O)": 365,
      "[C@@H](C)O)=O)": 366,
      "[C@@H](N1)": 367,
      "[C@H]1N(CCC1)": 368,
      "CC1": 369,
      "[C@H](C)N(C(=O)": 370,
      "[C@@H](Cc2ccccc2)C(N": 371,
      "C(N1CCCCC1)": 372,
      "CN(CCC)": 373,
      "[C@H](Cc3ccccc3)NC(": 374,
      "C)=O)Cc1ccccc1)": 375,
      "COC(C)(C)C)": 376,
      "(cc": 377,
      "[C@H](C(=O)N[C@H](C(=O)N": 378,
      "CC)": 379,
      "CCCO": 380,
      "N(C(=O)C)": 381,
      "[C@H](C)N(C(": 382,
      "CCC1": 383,
      "C[C@@H]1NC(=O)": 384,
      "[C@H](CC(C)C)C(N(": 385,
      "[C@H](CC(C)C)C(=O)N(": 386,
      "N1(C)": 387,
      "N(C(C)=O)": 388,
      "C)=O)Cc1ccccc1)=O)": 389,
      "[C@H](C(N[C@H](C(N": 390,
      "CC(C)C)=O)=O": 391,
      "[C@H](NC1=O)": 392,
      "C(C)(C)C": 393,
      "C1(=O)N": 394,
      "[C@H](C(N[C@H](C(=O)N": 395,
      "C2=O)=O)": 396,
      "C1(N": 397,
      "[C@H](C)C(=O)N": 398,
      "C[C@@H]1NC(": 399,
      "C)C)=O": 400,
      "C[C@H](NC(=O)": 401,
      "C[C@H](NC(": 402,
      "[C@@H](C)NC(": 403,
      "CCC1)=O)": 404,
      "CC(C)C)=O)CC(C)C)": 405,
      "cc1": 406,
      "CN(CC": 407,
      "C)=O)C)CC(C)C)=O)": 408,
      "Cc1cc": 409,
      "C[C@@H](C(=O)N": 410,
      "[C@H](C)C(N": 411,
      "C)NC(=O)": 412,
      "[C@@H](C)C(=O)N(": 413,
      "C[C@@H](NC(=O)": 414,
      "C)NC(": 415,
      "[C@@H](C(=O)N[C@@H](": 416,
      "[C@@H](C)C(N(": 417,
      "[C@H](C(=O)N[C@H](C(N": 418,
      "C[C@@H](NC(": 419,
      "C[C@@H](C(N": 420,
      "2CCC[C@H]2C(N(": 421,
      "C(=O)N1": 422,
      "[C@@H](C)NC(=O)": 423,
      "[C@@H](C(N[C@@H](": 424,
      "C(=O)N1CCCCC1)": 425,
      "C)=O)C)CC(C)C)": 426,
      "2CCC[C@H]2C(=O)N(": 427,
      "CN1C(=O)": 428,
      "[C@H](CC(C)C)C(=O)N(C)": 429,
      "CN1C(": 430,
      "CC(N2": 431,
      "CC(C)C)C)=O": 432,
      "Cl)": 433,
      "CCCOC(C)C)": 434,
      "[C@H](CC(C)C)C(N(C)": 435,
      "CC1)": 436,
      "C)=O)CCC2)=O)": 437,
      "CN(Cc3ccccc3)": 438,
      "C)=O)CC(C)C": 439,
      "CN(Cc2ccccc2)C(": 440,
      "(C)C": 441,
      "(c1)": 442,
      "2=O)": 443,
      "N2C(=O)": 444,
      "O=C1N(": 445,
      "CN(Cc2ccccc2)C(=O)": 446,
      "[C@@H]3N(CCC3)": 447,
      "[C@H]3N(CCC3)": 448,
      "N2C(": 449,
      "N1)=O)": 450,
      "C(=O)O[C@@H]1": 451,
      "[C@H](C(=O)N1)": 452,
      "C1=O)=O)=O)": 453,
      "C)C)CC(C)C)=O)": 454,
      "(C[C@H]2": 455,
      "3CC": 456,
      "C(O[C@@H]1": 457,
      "4ccccc": 458,
      "[C@H](CC(C)C)C(=O)N[C@@H](": 459,
      "[C@H](CC(C)C)C(N[C@@H](": 460,
      "[C@H](C(N1)=O)": 461,
      "ccc(": 462,
      "cccc1)": 463,
      "ccc1": 464,
      "C)=O)C)=O)=O)": 465,
      "3[C@@H](": 466,
      "C(N1CCCCC1)=O)=O)": 467,
      "CC(C)C)CC(C)C)": 468,
      "C)=O)CC(C)C)C)=O)": 469,
      "c2ccccc2)": 470,
      "c1cc(cc": 471,
      "Cc1ccccc1)=O)=O": 472,
      "c1cccc(c1)": 473,
      "3[C@H](": 474,
      "[C@H]1CCCN1C(=O)": 475,
      "[C@@H]1CC(C)C)=O)": 476,
      "[C@@H]1N(CCC1)": 477,
      "C(N1CCCCC1)=O)": 478,
      "C(=O)N1CCCCC1)=O)": 479,
      "C[C@@H](C(=O)N2CCCCC2)": 480,
      "c1c(cccc1)": 481,
      "[C@H]([C@@H](C)CC)": 482,
      "c1c(C": 483,
      "c1(": 484,
      "CN(C)C(": 485,
      "C)=O)CCC2)": 486,
      "[C@@H]3CCCN3C(=O)": 487,
      "C[C@@H](C(N2CCCCC2)=O)": 488,
      "CN(C)C(=O)": 489,
      "C)=O)CC(C)C)=O)=O)": 490,
      "[C@H]1CC(C)C)=O)": 491,
      "C)CCC2)=O)": 492,
      "4ccccc4)": 493,
      "[C@H](CC(=O)N": 494,
      "3[C@H](CCC3)": 495,
      "NC2=O)": 496,
      "[C@H]1(CC(C)C)": 497,
      "[C@@H](Cc3ccccc3)": 498,
      "[C@@H]1NC(=O)": 499,
      "[C@H]3CCCN3C(=O)": 500,
      "(C[C@@H]2": 501,
      "[C@@H](N1": 502,
      "F)F)": 503,
      "C(C(C)C)[C@H]1": 504,
      "Cc4ccccc4)": 505,
      "[C@H](Cc2ccccc2)N(C(=O)": 506,
      "[C@H](COC(C)(C)C)": 507,
      "[C@@H](C)C(N(C)": 508,
      "c1cc(ccc1)": 509,
      "Cc2ccc(cc2)": 510,
      "[C@H]([C@H](CC)C)": 511,
      "ccccc1": 512,
      "[C@@H]1NC(": 513,
      "CCCC)C(N": 514,
      "2CCC[C@H]2C(=O)N": 515,
      "[C@@H]1(CC(C)C)": 516,
      "cccc1": 517,
      "[C@@H](C)N(C(": 518,
      "Cc1ccccc1)=O)C": 519,
      "3[C@@H](CCC3)": 520,
      "[C@@H](C)N(C)C(": 521,
      "[C@H](CCCC)NC(=O)": 522,
      "[C@@H](C)C(=O)N(C)": 523,
      "[C@H]3CCCN3C(": 524,
      "c1ccc(C": 525,
      "CCCC)C(=O)N": 526,
      "[C@@H]3CCCN3C(": 527,
      "[C@H](CC": 528,
      "Cc2ccccc2)CC(=O)N": 529,
      "[C@@H](Cc1ccccc1)": 530,
      "[C@H](CCCC)NC(": 531,
      "CCC)C": 532,
      "[C@@H](C)N(C)C(=O)": 533,
      "2CCC[C@H]2C(N": 534,
      "C(c1ccccc1)": 535,
      "[C@@H]1CCCN1C(": 536,
      "CC1CC": 537,
      "[C@H](CC)C)=O)": 538,
      "Cc2ccccc2)CC(N": 539,
      "[C@H](Cc2ccccc2)N(C)C(": 540,
      "C(=O)N[C@@H](Cc2ccccc2)C(=O)N": 541,
      "c1(cccc": 542,
      "c1(ccccc1)": 543,
      "[C@H](Cc2ccccc2)N(C(": 544,
      "[n": 545,
      "[nH]": 546,
      "2CCC[C@@H]2C(=O)N": 547,
      "[C@@H](N(C1=O)": 548,
      "2CCC[C@@H]2C(N": 549,
      "CC(C)C)C)CC(C)C)": 550,
      "[C@@H](NC(=O)[C@@H](N(C)C(": 551,
      "[C@H](Cc2ccccc2)N(C)C(=O)": 552,
      "[C@H](Cc1ccccc1)": 553,
      "CCO": 554,
      "[C@@H](CC(C)C)C(=O)N[C@H](C(=O)N": 555,
      "OC(C)(C)C)=O)": 556,
      "[C@@H](N(C)C1=O)": 557,
      "C(=O)N[C@@H](Cc2ccccc2)C(N": 558,
      "[C@@H](NC([C@@H](N(C)C(": 559,
      "C[C@H]1C(N": 560,
      "C(=O)N[C@@H](C(N": 561,
      "C(=O)N[C@@H](C(=O)N": 562,
      "[C@@H](NC([C@@H](N(C(=O)": 563,
      "[C@@H](NC(=O)[C@@H](N(C(=O)": 564,
      "Cc1ccccc1)C": 565,
      "[C@@H](NC(=O)[C@@H](N(C)C(=O)": 566,
      "[C@@H](CC(C)C)C(=O)N[C@H](C(N": 567,
      "[C@@H](CC(C)C)C(N[C@H](C(=O)N": 568,
      "[C@@H](C)N(C(=O)": 569,
      "C1)=O)=O)": 570,
      "[C@@H](NC(=O)[C@@H](N(C(": 571,
      "C[C@H]1C(=O)N": 572,
      "[C@H]1N(CCC1)C(=O)": 573,
      "C(N[C@@H](C(N": 574,
      "[C@@H](NC([C@@H](N(C)C(=O)": 575,
      "[C@@H](CC(C)C)C(N[C@H](C(N": 576,
      "C)CCC2)": 577,
      "Cc1ccccc1)=O)=O)=O)": 578,
      "[C@H]([C@H](O)C)NC(=O)": 579,
      "[C@H]([C@@H](C)O)NC(": 580,
      "C)=O)C)C)": 581,
      "C(N[C@@H](C(=O)N": 582,
      "[C@H]([C@H](O)C)NC(": 583,
      "OCC2)": 584,
      "[C@@H](NC([C@@H](N(C(": 585,
      "2[C@@H](C(=O)N(": 586,
      "C)=O)CC(C)C)=O": 587,
      "[C@H]([C@H](OC(=O)": 588,
      "C)=O)=O)CC(C)C)=O)": 589,
      "[C@H]([C@H](OC(": 590,
      "[C@H]([C@@H](C)O)NC(=O)": 591,
      "[C@H](C2=O)": 592,
      "[C@H]([C@@H](C)OC(=O)": 593,
      "[C@H]([C@@H](C)OC(": 594,
      "[C@H](CC(N": 595,
      "2[C@H](CCC2)C(=O)N(": 596,
      "CC(C)C)C)C)=O)": 597,
      "[C@H]1N(C(=O)C)": 598,
      "[C@@H](NC([C@@H](NC(": 599,
      "C2)": 600,
      "Cc3ccccc3)C(N": 601,
      "O=C1N(C)": 602,
      "N(C)C1=O)=O)": 603,
      "Cc3ccccc3)C(=O)N": 604,
      "CN(CCC)C(=O)": 605,
      "CC1CCOCC": 606,
      "2[C@@H](C(N(": 607,
      "F)(": 608,
      "CN(CCC)C(": 609,
      "C)=O)C)C)=O)": 610,
      "C)=O)=O)C": 611,
      "C)=O)C)=O": 612,
      "CC(C)C)C)C)": 613,
      "CC(C)C)C)CC(C)C)=O)": 614,
      "Cc1ccccc1)=O)CC(C)C)=O)": 615,
      "2[C@H](CCC2)C(N(": 616,
      "C[C@H](Cc2ccccc2)NC(=O)": 617,
      "[C@@H](Cc2ccccc2)C(=O)N(": 618,
      "N12": 619,
      "Cc3ccccc3)CC(N": 620,
      "CC(N1": 621,
      "[C@H]1N(C(C)=O)": 622,
      "Cc1ccc(": 623,
      "[C@@H](NC([C@@H](NC(=O)": 624,
      "C[C@H](Cc2ccccc2)NC(": 625,
      "N(C2=O)": 626,
      "[C@@H](Cc2ccccc2)C(N(": 627,
      "[C@H](N1)": 628,
      "[C@@H]1CCCN1C(C)=O)=O)": 629,
      "CC1CCCCC1)": 630,
      "CCCC)=O)": 631,
      "[C@H](C)C(N(": 632,
      "NC1=O)=O)=O)": 633,
      "N)": 634,
      "CNC(": 635,
      "CCCCC)": 636,
      "[C@@H](NC(=O)[C@@H](NC(=O)": 637,
      "C(F)(": 638,
      "[C@H](C)C(=O)N(": 639,
      "CNC(=O)": 640,
      "CC(C)C)Cc1ccccc1)=O)": 641,
      "[C@@H](C": 642,
      "[C@H]1CCCN1C(": 643,
      "[C@H](C(=O)N1": 644,
      "C(C)(C)C[C@H]1": 645,
      "[C@@H]12": 646,
      "[C@H](C(N1": 647,
      "1)=O)=O)=O)": 648,
      "C(C(C)C)[C@@H]1": 649,
      "2CCC[C@@H]2C(=O)N(C)": 650,
      "2CCC[C@@H]2C(N(C)": 651,
      "CC1=O)": 652,
      "ccccc2": 653,
      "2CCC[C@H]2C(=O)N(C)": 654,
      "[C@H]12": 655,
      "C(C)C)=O)=O)": 656,
      "C)CC": 657,
      "Cc1ccc(cc1)": 658,
      "Cc1ccccc1)CC(C)C)=O)": 659,
      "2CCC[C@H]2C(N(C)": 660,
      "CCC[C@H]1": 661,
      "C)=O)=O)=O": 662,
      "[C@@H](NC(=O)[C@@H](NC(": 663,
      "N1(C(=O)": 664,
      "C)C)CC(C)C)": 665,
      "C1(=O)N(": 666,
      "1)=O)CC(C)C)=O)": 667,
      "2CCOCC2)": 668,
      "[C@H](CC(C)C)N1": 669,
      "3CCCCC3)": 670,
      "N1(C(": 671,
      "[C@@H](C)O": 672,
      "C1(N(": 673,
      "[C@@H](Cc2ccccc2)C(=O)N(C)": 674,
      "2[C@@H](CCC2)C(=O)N(": 675,
      "c3)": 676,
      "OC)": 677,
      "[C@@H]1C(=O)N": 678,
      "Cc2cc3": 679,
      "[C@@H](Cc2ccccc2)C(N(C)": 680,
      "c2c(": 681,
      "CC(=O)N1": 682,
      "[C@@H](C(=O)N1)": 683,
      "C2)=O)": 684,
      "c1)=O)": 685,
      "[C@H]1[C@@H](C)OC(": 686,
      "NC([C@@H](N(C(=O)": 687,
      "2[C@H](C(N(": 688,
      "2[C@H](C(=O)N(": 689,
      "CN(C1=O)": 690,
      "cc3)": 691,
      "N1CC": 692,
      "CCC(=O)N": 693,
      "O)=O)": 694,
      "[C@@H]1C(N": 695,
      "CCC2)=O)C": 696,
      "Cc2ccc3": 697,
      "NC(=O)[C@@H](N(C(=O)": 698,
      "NC(=O)[C@@H](N(C)C(=O)": 699,
      "NC([C@@H](N(C(": 700,
      "CC2CCCCC2)": 701,
      "NC(=O)[C@@H](N(C(": 702,
      "[C@H](CC(C)C)NC1=O)=O)": 703,
      "NC([C@@H](N(C)C(=O)": 704,
      "CC(C)C)Cc1ccccc1)": 705,
      "Cc3ccccc3)CC(=O)N": 706,
      "CN(Cc3ccccc3)C(=O)": 707,
      "[C@@H]1N(CCC1)C(=O)": 708,
      "CN(Cc3ccccc3)C(": 709,
      "cc1)=O)": 710,
      "[C@H]1[C@H](OC(=O)": 711,
      "C)=O)=O)=O)=O)": 712,
      "C(F)(F)F)": 713,
      "2)=O)=O)": 714,
      "N2[C@@H](": 715,
      "NC([C@@H](N(C)C(": 716,
      "C)=O)Cc1ccccc1": 717,
      "CC(C)C)=O)=O)=O": 718,
      "C(N[C@@H](Cc2ccccc2)C(=O)N": 719,
      "[C@H]3N(CCC3)C(=O)": 720,
      "N2[C@H](": 721,
      "[C@H]1[C@H](OC(": 722,
      "Cc1ccccc1)=O)CC(C)C": 723,
      "[C@H](C(N[C@H](C(N(": 724,
      "C(C[C@H]1": 725,
      "[C@H](N1": 726,
      "NC(=O)[C@@H](N(C)C(": 727,
      "[C@H](CC(C)C)N(C1=O)": 728,
      "C)C)C": 729,
      "CC(C)C)=O)=O)C": 730,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C(": 731,
      "[C@H](C(=O)N[C@H](C(N(": 732,
      "2[C@@H](CCC2)C(N(": 733,
      "[C@@H]3N(CCC3)C(=O)": 734,
      "(Cl)": 735,
      "[C@H]1[C@@H](C)OC(=O)": 736,
      "[C@H](C(N[C@H](C(=O)N(": 737,
      "[C@@H](CC(C)C)C(N[C@@H](Cc2ccccc2)": 738,
      "[C@@H](CC(C)C)NC1=O)=O)": 739,
      "CC(C)C)=O)CC(C)C": 740,
      "[C@H]2CCCN2C(=O)[C@@H](NC(": 741,
      "C)=O)[C@H](O)": 742,
      "C)CC(C)C)C": 743,
      "[C@@H](C)C(=O)N[C@@H](": 744,
      "C(C)(C[C@H]1": 745,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C)C(": 746,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C)C(=O)": 747,
      "CCC4)": 748,
      "Cc2ccccc2)=O)=O)": 749,
      "[C@@H](C(N[C@H](C(N": 750,
      "[C@@H]1N(C(C)=O)": 751,
      "[C@@H](C(N[C@H](C(=O)N": 752,
      "C1CC[C@@H]2": 753,
      "C(N[C@@H](Cc2ccccc2)C(N": 754,
      "[C@@H](C1=O)": 755,
      "CC(C)C)CC(C)C": 756,
      "cccc3)": 757,
      "ccc2)": 758,
      "[C@@H](NC([C@H](CC(C)C)N(C(": 759,
      "[C@@H](C(=O)N[C@H](C(N": 760,
      "C)CC(C)C)=O)C": 761,
      "[C@H](C)C": 762,
      "[C@@H](NC([C@H](CC(C)C)N(C)C(=O)": 763,
      "O)cc2)": 764,
      "C1CC[C@H]2": 765,
      "[C@H](C)C(=O)N(C)": 766,
      "[C@@H](NC(=O)[C@H](CC(C)C)N(C(=O)": 767,
      "[C@H]2CCCN2C1=O)=O)": 768,
      "CCC3)=O)=O)": 769,
      "c1ccccc1)=O)": 770,
      "[C@H](C(N[C@H](C(N(C)": 771,
      "CCC(N": 772,
      "[C@H](C(N[C@H](C(=O)N(C)": 773,
      "C)C(C)C)": 774,
      "CCCC)=O": 775,
      "[C@@H]1CC(C)C)": 776,
      "[C@H](C(=O)N[C@H](C(=O)N(": 777,
      "C)=O)C)C": 778,
      "[C@@H]3N(CCC3)C(": 779,
      "C)C)=O)CC(C)C)=O)": 780,
      "C)CC(C)C)=O)=O": 781,
      "[C@@H](C(=O)N[C@H](C(=O)N": 782,
      "C(C[C@@H]1": 783,
      "[C@H]1Cc1ccccc1)": 784,
      "C)CC(C)C)=O)CC(C)C)=O)": 785,
      "C)CC(C)C)=O)=O)=O)": 786,
      "[C@@H](C)C(N[C@@H](": 787,
      "[C@@H](NC([C@H](CC(C)C)N(C)C(": 788,
      "C(=O)N1)": 789,
      "[C@H](C)C(N(C)": 790,
      "[C@@H](C(N1)=O)": 791,
      "Cc2ccc(O)cc2)": 792,
      "[C@H](N(C1=O)": 793,
      "[C@@H]1N(C(=O)C)": 794,
      "[C@@H](CC(C)C)C(N2CCC[C@@H]2": 795,
      "CC1CCCCC1)=O)": 796,
      "[C@H](CC(C)C)C(=O)N[C@H](C(N": 797,
      "C(C)(C[C@@H]1": 798,
      "[C@@H](CC)": 799,
      "[C@@H]2N(C1=O)": 800,
      "[C@H](CC(C)C)C(=O)N[C@H](C(=O)N": 801,
      "c1cn": 802,
      "[C@H](C(=O)N[C@H](C(N(C)": 803,
      "[C@@H](NC2=O)": 804,
      "[C@H]3N(C(": 805,
      "C1CCN2": 806,
      "[C@H](C(=O)N[C@H](C(=O)N(C)": 807,
      "[C@H](CC(C)C)C(N[C@H](C(=O)N": 808,
      "[C@@H](NC([C@H](CC(C)C)N(C(=O)": 809,
      "[C@H](N(C)C1=O)": 810,
      "[C@H]3N(C(=O)": 811,
      "[C@H]1CCCN1C(C)=O)=O)": 812,
      "C)=O)=O)CC(C)C)": 813,
      "[C@@H](NC1=O)Cc1ccccc1)=O)": 814,
      "Cc1cc2": 815,
      "[C@H](CC(C)C)C(N[C@H](C(N": 816,
      "[C@H]1N(CCC1)C(": 817,
      "4CCC": 818,
      "[C@@H]1CC(C)C)=O)=O)": 819,
      "[C@@H](NC([C@H](NC(=O)": 820,
      "[C@@H]3N(C(": 821,
      "ccccc3": 822,
      "(C)": 823,
      "[C@@H](CC(C)C)C(=O)N2CCC[C@@H]2": 824,
      "C)C(C)C)=O)": 825,
      "CCC2)C": 826,
      "[C@@H](NC(=O)[C@H](NC(=O)": 827,
      "CC(C)C)=O)Cc1ccccc1)": 828,
      "CC(N[C@@H](": 829,
      "[C@H](CC)": 830,
      "CC(N[C@H](C(N(": 831,
      "[C@H]3N(CCC3)C(": 832,
      "C)[C@H](O)": 833,
      "C(O[C@@H]([C@H](NC(=O)": 834,
      "Cc2ccc(cc2)O)": 835,
      "2[C@@H](C(N": 836,
      "[C@@H]2CCCN2C1=O)=O)": 837,
      "(=O)": 838,
      "[C@@H](CC(C)C)C1=O)": 839,
      "cccc2)": 840,
      "CC(C)C)=O)Cc1ccccc1)=O)": 841,
      "CCCCCC": 842,
      "[C@H]1Cc1ccccc1)=O)": 843,
      "C)C)=O)=O)=O)": 844,
      "C)Cc1ccccc1": 845,
      "CC(N[C@H](C(=O)N(": 846,
      "[C@H]1CC(C)C)": 847,
      "C)C)=O)C": 848,
      "CC(C)C)C)=O)=O": 849,
      "[C@@H]1C(N(": 850,
      "[C@@H]2N1": 851,
      "CC(C)C)C)=O)CC(C)C)=O)": 852,
      "C(O[C@H](C)[C@H](NC(=O)": 853,
      "[C@@H](NC([C@H](NC(": 854,
      "cs": 855,
      "N1)=O)=O)": 856,
      "[C@@H]1C(=O)N(": 857,
      "[C@@H](NC(=O)CN(C(=O)": 858,
      "CCC2)=O)=O": 859,
      "C(=O)O[C@H](C)[C@H](NC(": 860,
      "[C@H]1CC(C)C)=O)=O)": 861,
      "[C@H]2N(C1=O)": 862,
      "2[C@@H]1": 863,
      "[C@@H](NC(=O)[C@H](NC(": 864,
      "[C@@H](NC(=O)CN(C(": 865,
      "CC(N1)=O)": 866,
      "[C@@H]3N(C(=O)": 867,
      "C(=O)O[C@@H]([C@H](NC(": 868,
      "[C@@H](CC(C)C)C(N1": 869,
      "2[C@H](C(=O)N": 870,
      "C(O[C@@H]([C@H](NC(": 871,
      "Cn": 872,
      "[C@@H](CC(C)C)C(=O)N1)": 873,
      "C(=O)O[C@@H]([C@H](NC(=O)": 874,
      "[C@H]1(NC(=O)": 875,
      "CC(C)C)C)=O)C": 876,
      "C)=O)CC": 877,
      "C)=O)C(C)C)": 878,
      "=O)=O)C": 879,
      "[C@H]1NC(=O)": 880,
      "CC(=O)N1)": 881,
      "2[C@H](CCC2)C(=O)N": 882,
      "2[C@H](C(N": 883,
      "C)C(C)C": 884,
      "O=C(": 885,
      "C(=O)O[C@H](C)[C@H](NC(=O)": 886,
      "[C@H]1N(C(=O)C)CCC1)": 887,
      "Cc3ccc(": 888,
      "(C[C@@H]2NC(": 889,
      "[C@H](Cc4ccccc4)": 890,
      "Cc3cc": 891,
      "C)Cc1ccccc1)=O)=O)": 892,
      "[C@@H](NC(CN(C(": 893,
      "[C@H](C(C)C)NC(=O)": 894,
      "[C@H](C(C)C)NC(": 895,
      "N(C1)": 896,
      "C1(=O)N(C)": 897,
      "[C@@H](CC(C)C)C(N1)=O)": 898,
      "CCCC)=O)=O)": 899,
      "C1N(": 900,
      "CN(CC)": 901,
      "N1(C)C(=O)": 902,
      "[C@H]1NC(": 903,
      "2[C@@H](CCC2)C(N": 904,
      "2CCCN1": 905,
      ")=O)": 906,
      "C[C@H](Cc3ccccc3)NC(=O)": 907,
      "c1(C[C@H]2": 908,
      "CN(CCCCC)": 909,
      "OCOc2": 910,
      "[C@@H]([C@@H](C)CC)": 911,
      "[C@@H](NC(CN(C(=O)": 912,
      "N1(C)C(": 913,
      "CC)C": 914,
      "CN(CCCOC(C)C)": 915,
      "CC(C)C)C)C": 916,
      "O1": 917,
      "Cc2cccc": 918,
      "CCC2)=O)CC(C)C)=O)": 919,
      "C)C(=O)N": 920,
      "[C@@H](C)O)C(=O)N(": 921,
      "[C@H]2N1": 922,
      "C[C@H](Cc3ccccc3)NC(": 923,
      "cccn": 924,
      "[C@H]2CCCN2C1=O)": 925,
      "c1c(C[C@H]2": 926,
      "OCOc3": 927,
      "[C@H]1N(C(C)=O)CCC1)": 928,
      "N(CC1)": 929,
      "N(C)C2=O)": 930,
      "2[C@@H](CCC2)C(=O)N": 931,
      "OCO3)": 932,
      "CS": 933,
      "[C@@H](CC(C)C)C(=O)N1": 934,
      "c1cc(C[C@H]2": 935,
      "[C@H](C(N[C@@H]([C@H](O)C)": 936,
      "c1ccc(C[C@H]2": 937,
      "C1C[C@H]2": 938,
      "[C@@H]([C@H](CC)C)": 939,
      "c1cccc(C[C@H]2": 940,
      "C1(N(C)": 941,
      "NC2=O)=O)": 942,
      "CC(C)C)CCC2)": 943,
      "[C@@H](CC(C)C)N1": 944,
      "2CCC[C@H]1": 945,
      "[C@H]1(NC(": 946,
      "C(=O)N(C)[C@H](C(=O)N": 947,
      "CC(=O)N[C@H](C(=O)N(": 948,
      "(C[C@@H]2NC(=O)": 949,
      "[C@H](Cc2ccccc2)NC1=O)=O)": 950,
      "CC1)=O)": 951,
      "C)C)=O)=O": 952,
      "[C@@H](CC(C)C)NC1=O)": 953,
      "C(O[C@H](C)[C@H](NC(": 954,
      "Cc1ccccc1)=O)Cc1ccccc1)=O)": 955,
      "CC(=O)N[C@@H](Cc2ccccc2)": 956,
      "2[C@H](CCC2)C(N": 957,
      "[C@H]2CCCN2C([C@@H](NC(": 958,
      "[C@@H]1(Cc2ccccc2)": 959,
      "C)=O)CC(C)C)C": 960,
      "C)(C)C": 961,
      "[C@@H](Cc2ccccc2)C(=O)N[C@@H](": 962,
      "C)=O)Cc1ccccc1)=O": 963,
      "c1ccccc1C[C@H]1": 964,
      "C(c1ccccc1)[C@H]1": 965,
      "[C@H](CC(C)C)NC1=O)": 966,
      "C)=O)=O)CC(C)C": 967,
      "C)CC(C)C)CC(C)C)=O)": 968,
      "CC(C)C)=O)=O)CC(C)C)=O)": 969,
      "[C@@H](CC(C)C)C(N2CCC[C@H]2": 970,
      "C2=O)=O)=O)": 971,
      "[C@@H](C)O)C(N(": 972,
      "CCCCN)": 973,
      "Cc1ccccc1)CC(C)C": 974,
      "2[C@@H](C(=O)N": 975,
      "[C@H]1CC(C)C)C)=O)": 976,
      "NC([C@@H](NC(=O)": 977,
      "CN(CCC": 978,
      "c1ccc(C[C@@H]2": 979,
      "[C@@H](CC(C)C)C(=O)N2CCC[C@H]2": 980,
      "[C@H]2CCCN2C(=O)[C@@H](NC(=O)": 981,
      "CCCCC": 982,
      "CC(=O)N[C@H](C(N(": 983,
      "C(=O)N(C)[C@H](C(N": 984,
      "[C@@H](C(=O)N1": 985,
      "[C@H]2CCCN2C([C@@H](NC(=O)": 986,
      "3CCC[C@@H]3C(=O)N(": 987,
      "[C@H]1N(CCC1)C(C)=O)=O)": 988,
      "c2ccccc2": 989,
      "[C@@H](NC1=O)Cc1ccccc1)": 990,
      "[C@H]1N(C(=O)C)CCC1)=O)": 991,
      "[C@H](O": 992,
      "O)cc1)": 993,
      "c1c(C[C@@H]2": 994,
      "C)C(N": 995,
      "CC(C)C)CC(C)C)=O": 996,
      "[C@@H]2CCCN2C(C)=O)=O)": 997,
      "2[C@H]1": 998,
      "NC([C@H](CC(C)C)N(C)C(": 999
    },
    "merges": [
      [
        "C",
        "("
      ],
      [
        "C",
        ")"
      ],
      [
        "=",
        "O"
      ],
      [
        "=O",
        ")"
      ],
      [
        "H",
        "]"
      ],
      [
        "C",
        "@"
      ],
      [
        "[",
        "C@"
      ],
      [
        "H]",
        "("
      ],
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "C(",
        "=O)"
      ],
      [
        "C)",
        "C)"
      ],
      [
        "N",
        "("
      ],
      [
        "[C@",
        "H]("
      ],
      [
        "[C@@",
        "H]("
      ],
      [
        "C",
        "C("
      ],
      [
        "CC(",
        "C)C)"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c",
        "1"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "N(",
        "C)"
      ],
      [
        "C(",
        "N"
      ],
      [
        "2",
        ")"
      ],
      [
        "=O)",
        "=O)"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "N",
        "C("
      ],
      [
        "C",
        "1"
      ],
      [
        "C)",
        "=O)"
      ],
      [
        "[C@@H](",
        "CC(C)C)"
      ],
      [
        "[C@H](",
        "CC(C)C)"
      ],
      [
        "c1",
        "cccc"
      ],
      [
        "C",
        "c"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "cccc",
        "c"
      ],
      [
        "CCC",
        "2)"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "CC(C)C)",
        "=O)"
      ],
      [
        "2",
        "CCC"
      ],
      [
        "Cc1ccccc1",
        ")"
      ],
      [
        "Cc",
        "2"
      ],
      [
        "1",
        ")"
      ],
      [
        "N(",
        "C(=O)"
      ],
      [
        "N(",
        "C("
      ],
      [
        "ccccc",
        "2)"
      ],
      [
        "Cc2",
        "ccccc2)"
      ],
      [
        "[C@@H](",
        "C)"
      ],
      [
        "[C@@H]",
        "1"
      ],
      [
        "[C@H]",
        "1"
      ],
      [
        "C(=O)",
        "N("
      ],
      [
        "N",
        "1"
      ],
      [
        "C(",
        "N("
      ],
      [
        "N",
        "2"
      ],
      [
        "[C@H](",
        "C(=O)N"
      ],
      [
        "[C@H](",
        "C(N"
      ],
      [
        "C)",
        "C"
      ],
      [
        "N(C)",
        "C("
      ],
      [
        "[C@@H]",
        "2"
      ],
      [
        "N(C)",
        "C(=O)"
      ],
      [
        "[C@H]",
        "2"
      ],
      [
        "C(=O)",
        "N(C)"
      ],
      [
        "3",
        ")"
      ],
      [
        "[C@H](",
        "C)"
      ],
      [
        "2CCC",
        "N2"
      ],
      [
        "[C@@H](",
        "NC(=O)"
      ],
      [
        "[C@@H](",
        "NC("
      ],
      [
        "C(",
        "N(C)"
      ],
      [
        "C)",
        "=O)=O)"
      ],
      [
        "O",
        ")"
      ],
      [
        "C1",
        "=O)"
      ],
      [
        "Cc1ccccc1)",
        "=O)"
      ],
      [
        "C(",
        "C)C)"
      ],
      [
        "C(=O)N",
        "[C@@H]("
      ],
      [
        "CC(",
        "C)C"
      ],
      [
        "C)",
        "CC(C)C)"
      ],
      [
        "CCC",
        "1)"
      ],
      [
        "C(N",
        "[C@@H]("
      ],
      [
        "[C@H](",
        "Cc2ccccc2)"
      ],
      [
        "c",
        "("
      ],
      [
        "CCC2)",
        "=O)"
      ],
      [
        "Cc",
        "3"
      ],
      [
        "O",
        "="
      ],
      [
        "[C@H]",
        "2CCCN2"
      ],
      [
        "N(",
        "CCC2)"
      ],
      [
        "[C@@H]",
        "2CCCN2"
      ],
      [
        "CC(",
        "N"
      ],
      [
        "[C@H](",
        "NC(=O)"
      ],
      [
        "ccccc",
        "3)"
      ],
      [
        "CC(C)C)",
        "=O)=O)"
      ],
      [
        "C)C)",
        "=O)"
      ],
      [
        "[C@H](",
        "NC("
      ],
      [
        "Cc3",
        "ccccc3)"
      ],
      [
        "C1",
        "("
      ],
      [
        "2CCC",
        "[C@@H]2"
      ],
      [
        "O=",
        "C1"
      ],
      [
        "C",
        "N("
      ],
      [
        "C)",
        "CC(C)C)=O)"
      ],
      [
        "2CCC",
        "[C@H]2"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N"
      ],
      [
        "CCC",
        "3)"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N"
      ],
      [
        "C",
        "C(=O)N"
      ],
      [
        "1",
        "CC"
      ],
      [
        "1)",
        "=O)"
      ],
      [
        "C)",
        "=O"
      ],
      [
        "2",
        "[C@@H]("
      ],
      [
        "O",
        "C("
      ],
      [
        "3",
        "CCC"
      ],
      [
        "C1",
        "=O)=O)"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "C)",
        "("
      ],
      [
        "2",
        "CC"
      ],
      [
        "[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "[C@@H](",
        "N(C(=O)"
      ],
      [
        "[C@@H](",
        "N(C("
      ],
      [
        "[C@@H](",
        "N(C)C("
      ],
      [
        "[C@@H](",
        "N(C)C(=O)"
      ],
      [
        "[C@H](",
        "C(N("
      ],
      [
        "CC(C)C)",
        "C)=O)"
      ],
      [
        "[C@H](",
        "C(=O)N("
      ],
      [
        "[C@@H](",
        "C(=O)N"
      ],
      [
        "1CC",
        "CCC1)"
      ],
      [
        "[C@H](",
        "C"
      ],
      [
        "[C@@H](",
        "C(N"
      ],
      [
        "[C@H](",
        "O)"
      ],
      [
        "[C@H](CC(C)C)",
        "NC(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "NC("
      ],
      [
        "[C@@H](C)",
        "O)"
      ],
      [
        "C",
        "[C@@H]1"
      ],
      [
        "C",
        "[C@H]1"
      ],
      [
        "C1",
        ")"
      ],
      [
        "2",
        "[C@H]("
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N"
      ],
      [
        "CC(C)C)",
        "=O"
      ],
      [
        "CCC",
        "N1"
      ],
      [
        "N",
        "C1=O)"
      ],
      [
        "[C@H](",
        "C(N(C)"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "[C@H](",
        "C(=O)N(C)"
      ],
      [
        "C",
        "N1"
      ],
      [
        "[C@@H]2",
        "N(CCC2)"
      ],
      [
        "=O)=O)",
        "=O)"
      ],
      [
        "CCC",
        "C)"
      ],
      [
        "C",
        "N(C(=O)"
      ],
      [
        "[C@H]2",
        "N(CCC2)"
      ],
      [
        "C",
        "N(C("
      ],
      [
        "[C@@H](CC(C)C)",
        "NC("
      ],
      [
        "[C@@H](CC(C)C)",
        "NC(=O)"
      ],
      [
        "C1(",
        "=O)"
      ],
      [
        "C",
        "2"
      ],
      [
        "c1",
        ")"
      ],
      [
        "[C@H]2CCCN2",
        "C(=O)"
      ],
      [
        "[C@H]2CCCN2",
        "C("
      ],
      [
        "[C@@H]2CCCN2",
        "C(=O)"
      ],
      [
        "[C@@H]2CCCN2",
        "C("
      ],
      [
        "C(",
        "O"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C("
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C)C("
      ],
      [
        "[C@H](CC(C)C)",
        "N(C(=O)"
      ],
      [
        "N",
        "3"
      ],
      [
        "[C@H](CC(C)C)",
        "N(C)C(=O)"
      ],
      [
        "C)=O)",
        "C)=O)"
      ],
      [
        "O",
        "C(=O)"
      ],
      [
        "2[C@H](",
        "CCC2)"
      ],
      [
        "3CCC",
        "N3"
      ],
      [
        "[C@@H]",
        "3"
      ],
      [
        "Cc1ccccc1)",
        "=O)=O)"
      ],
      [
        "[C@@H](C)",
        "C"
      ],
      [
        "[C@H]",
        "3"
      ],
      [
        "C)=O)",
        "CC(C)C)=O)"
      ],
      [
        "[C@H](",
        "Cc3ccccc3)"
      ],
      [
        "[C@@H]1",
        "("
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "N1",
        "("
      ],
      [
        "[C@H]1",
        "("
      ],
      [
        "2[C@@H](",
        "CCC2)"
      ],
      [
        "c",
        "2"
      ],
      [
        "F",
        ")"
      ],
      [
        "CC(",
        "N("
      ],
      [
        "[C@H](Cc2ccccc2)",
        "NC("
      ],
      [
        "2CC",
        "CCC2)"
      ],
      [
        "[C@H](",
        "N(C)C(=O)"
      ],
      [
        "OC(",
        "C)("
      ],
      [
        "[C@H](",
        "N(C(=O)"
      ],
      [
        "[C@H](Cc2ccccc2)",
        "NC(=O)"
      ],
      [
        "C)=O)",
        "CC(C)C)"
      ],
      [
        "[C@H](O)",
        "C)"
      ],
      [
        "[C@H](",
        "N(C)C("
      ],
      [
        "[C@H](",
        "N(C("
      ],
      [
        "Cc1ccccc1)",
        "=O"
      ],
      [
        "CC",
        "C)"
      ],
      [
        "[C@H](C(=O)N",
        "[C@@H]("
      ],
      [
        "Cc2",
        "cc"
      ],
      [
        "N(",
        "C1=O)"
      ],
      [
        "[C@H](C(N",
        "[C@@H]("
      ],
      [
        "N",
        "1)"
      ],
      [
        "(",
        "C"
      ],
      [
        "C)=O)=O)",
        "=O)"
      ],
      [
        "C2",
        "=O)"
      ],
      [
        "CC(",
        "N(C)"
      ],
      [
        "[C@@H](C)",
        "C(=O)N"
      ],
      [
        "[C@@H](C)",
        "C(N"
      ],
      [
        "C(=O)N[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "C(",
        "C)("
      ],
      [
        "cc",
        "1)"
      ],
      [
        "1CCCCC1)",
        "=O)"
      ],
      [
        "C",
        "C(=O)N("
      ],
      [
        "[C@H](C",
        "C)C)"
      ],
      [
        "[C@@H]1",
        "CCCN1"
      ],
      [
        "[C@@H](",
        "NC1=O)"
      ],
      [
        "C)=O)",
        "C"
      ],
      [
        "[C@H](",
        "C(C)C)"
      ],
      [
        "2CC",
        "CCC2)=O)"
      ],
      [
        "N",
        "C1=O)=O)"
      ],
      [
        "N(",
        "CCC1)"
      ],
      [
        "C(C)C)",
        "=O)"
      ],
      [
        "OC(C)(",
        "C)C)"
      ],
      [
        "C",
        "C(=O)N(C)"
      ],
      [
        "O",
        "CC"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C(=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C("
      ],
      [
        "cc",
        "2)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C)C(=O)"
      ],
      [
        "[C@@H]2",
        "N(C(=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "N(C)C("
      ],
      [
        "O=C1",
        "N"
      ],
      [
        "[C@@H]2",
        "N(C("
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N[C@@H]("
      ],
      [
        "[C@H]2",
        "N(C(=O)"
      ],
      [
        "[C@@H]2N(CCC2)",
        "C("
      ],
      [
        "C1",
        "CC"
      ],
      [
        "[C@@H]2N(CCC2)",
        "C(=O)"
      ],
      [
        "[C@H]2",
        "N(C("
      ],
      [
        "[C@H]2N(CCC2)",
        "C("
      ],
      [
        "C)CC(C)C)",
        "=O)=O)"
      ],
      [
        "C(",
        "C)C"
      ],
      [
        "CC(C)C)=O)",
        "CC(C)C)=O)"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N("
      ],
      [
        "CC(C)C)",
        "C"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N("
      ],
      [
        "[C@H]2N(CCC2)",
        "C(=O)"
      ],
      [
        "CN(",
        "Cc2ccccc2)"
      ],
      [
        "[C@H](C)",
        "NC(=O)"
      ],
      [
        "CCC3)",
        "=O)"
      ],
      [
        "c",
        "2)"
      ],
      [
        "[C@H](C)",
        "NC("
      ],
      [
        "C1)",
        "=O)"
      ],
      [
        "C)=O)",
        "C)"
      ],
      [
        "[C@@H](C)C",
        "C)"
      ],
      [
        "CC(C)C)",
        "C)"
      ],
      [
        "[C@@H]",
        "3CCCN3"
      ],
      [
        "C)C)",
        "=O)=O)"
      ],
      [
        "[C@H](",
        "CCCC)"
      ],
      [
        "c1",
        "c("
      ],
      [
        "1)",
        "=O)=O)"
      ],
      [
        "2)",
        "=O)"
      ],
      [
        "N(",
        "CCC3)"
      ],
      [
        "[C@H]",
        "3CCCN3"
      ],
      [
        "[C@H](",
        "OC(=O)"
      ],
      [
        "O",
        "C"
      ],
      [
        "[C@H](",
        "OC("
      ],
      [
        "[C@@H](C)",
        "OC("
      ],
      [
        "C(=O)N",
        "[C@H](C(N"
      ],
      [
        "CCC",
        "2"
      ],
      [
        "[C@@H](C)",
        "OC(=O)"
      ],
      [
        "C(N",
        "[C@H](C(N"
      ],
      [
        "C(=O)N",
        "[C@H](C(=O)N"
      ],
      [
        "C)=O)",
        "=O"
      ],
      [
        "[C@@H](",
        "C(N("
      ],
      [
        "[C@H]1",
        "CCCN1"
      ],
      [
        "[C@@H](",
        "C(=O)N("
      ],
      [
        "C(N",
        "[C@H](C(=O)N"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(N(C)"
      ],
      [
        "[C@@H](",
        "C(C)C)"
      ],
      [
        "3CCC",
        "[C@@H]3"
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](CC(C)C)",
        "C(=O)N(C)"
      ],
      [
        "C(N[C@@H](",
        "Cc2ccccc2)"
      ],
      [
        "c1ccccc1",
        ")"
      ],
      [
        "C1",
        "C"
      ],
      [
        "Cc2cc",
        "c("
      ],
      [
        "C(",
        "C(C)C)"
      ],
      [
        "c1ccc(",
        "cc1)"
      ],
      [
        "3CCC",
        "[C@H]3"
      ],
      [
        "CCC2)",
        "=O)=O)"
      ],
      [
        "CC(C)C",
        "[C@H]1"
      ],
      [
        "N1",
        "C("
      ],
      [
        "C(N",
        "1"
      ],
      [
        "N1",
        "C(=O)"
      ],
      [
        "c",
        "3"
      ],
      [
        "CC(C)C",
        "[C@@H]1"
      ],
      [
        "C(",
        "C)=O)=O)"
      ],
      [
        "CC(",
        "C[C@@H]1"
      ],
      [
        "CC(",
        "C[C@H]1"
      ],
      [
        "CC(C)C)",
        "CC(C)C)=O)"
      ],
      [
        "CC(C)C)=O)=O)",
        "=O)"
      ],
      [
        "C(",
        "[C@H]1"
      ],
      [
        "[C@H](",
        "C1=O)"
      ],
      [
        "4",
        ")"
      ],
      [
        "N(C)",
        "C1=O)"
      ],
      [
        "Cc2ccccc2)",
        "=O)"
      ],
      [
        "C)CC(C)C)",
        "=O"
      ],
      [
        "CC(C)C)",
        "C)=O)=O)"
      ],
      [
        "C(",
        "[C@@H]1"
      ],
      [
        "[C@H](",
        "[C@H](O)C)"
      ],
      [
        "[C@H](",
        "[C@@H](C)O)"
      ],
      [
        "CCC2)",
        "=O"
      ],
      [
        "OC",
        "O"
      ],
      [
        "l",
        ")"
      ],
      [
        "C",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](",
        "C(N(C)"
      ],
      [
        "C)",
        "Cc1ccccc1)"
      ],
      [
        "2CCC[C@@H]2",
        "C(N("
      ],
      [
        "C)",
        "CC(C)C"
      ],
      [
        "C)",
        "Cc1ccccc1)=O)"
      ],
      [
        "2CCC[C@@H]2",
        "C(=O)N("
      ],
      [
        "[C@H](C)",
        "N(C)C("
      ],
      [
        "C(O",
        "[C@@H]("
      ],
      [
        "c",
        "n"
      ],
      [
        "[C@H](C)",
        "N(C)C(=O)"
      ],
      [
        "C(=O)O",
        "[C@@H]("
      ],
      [
        "C(=O)O",
        "[C@H](C)"
      ],
      [
        "CC(C)C)=O)",
        "C"
      ],
      [
        "[C@@H](",
        "C(=O)N(C)"
      ],
      [
        "[C@@H](Cc2ccccc2)",
        "C(=O)N"
      ],
      [
        "[C@H](Cc3ccccc3)",
        "NC(=O)"
      ],
      [
        "C(O",
        "[C@H](C)"
      ],
      [
        "[C@@H]1CCCN1",
        "C(=O)"
      ],
      [
        "[C@@H](C)O)",
        "=O)"
      ],
      [
        "[C@@H](",
        "N1)"
      ],
      [
        "[C@H]1",
        "N(CCC1)"
      ],
      [
        "CC",
        "1"
      ],
      [
        "[C@H](C)",
        "N(C(=O)"
      ],
      [
        "[C@@H](Cc2ccccc2)",
        "C(N"
      ],
      [
        "C(N",
        "1CCCCC1)"
      ],
      [
        "CN(",
        "CCC)"
      ],
      [
        "[C@H](Cc3ccccc3)",
        "NC("
      ],
      [
        "C)=O)",
        "Cc1ccccc1)"
      ],
      [
        "C",
        "OC(C)(C)C)"
      ],
      [
        "(",
        "cc"
      ],
      [
        "[C@H](C(=O)N",
        "[C@H](C(=O)N"
      ],
      [
        "C",
        "C)"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "N(C(=O)",
        "C)"
      ],
      [
        "[C@H](C)",
        "N(C("
      ],
      [
        "CCC",
        "1"
      ],
      [
        "C[C@@H]1",
        "NC(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N("
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N("
      ],
      [
        "N1(",
        "C)"
      ],
      [
        "N(C(",
        "C)=O)"
      ],
      [
        "C)=O)",
        "Cc1ccccc1)=O)"
      ],
      [
        "[C@H](C(N",
        "[C@H](C(N"
      ],
      [
        "CC(C)C)=O)",
        "=O"
      ],
      [
        "[C@H](",
        "NC1=O)"
      ],
      [
        "C(C)(",
        "C)C"
      ],
      [
        "C1(=O)",
        "N"
      ],
      [
        "[C@H](C(N",
        "[C@H](C(=O)N"
      ],
      [
        "C2",
        "=O)=O)"
      ],
      [
        "C1(",
        "N"
      ],
      [
        "[C@H](C)",
        "C(=O)N"
      ],
      [
        "C[C@@H]1",
        "NC("
      ],
      [
        "C)C)",
        "=O"
      ],
      [
        "C",
        "[C@H](NC(=O)"
      ],
      [
        "C",
        "[C@H](NC("
      ],
      [
        "[C@@H](C)",
        "NC("
      ],
      [
        "CCC1)",
        "=O)"
      ],
      [
        "CC(C)C)=O)",
        "CC(C)C)"
      ],
      [
        "cc",
        "1"
      ],
      [
        "CN(",
        "CC"
      ],
      [
        "C)=O)",
        "C)CC(C)C)=O)"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "C",
        "[C@@H](C(=O)N"
      ],
      [
        "[C@H](C)",
        "C(N"
      ],
      [
        "C)",
        "NC(=O)"
      ],
      [
        "[C@@H](C)",
        "C(=O)N("
      ],
      [
        "C",
        "[C@@H](NC(=O)"
      ],
      [
        "C)",
        "NC("
      ],
      [
        "[C@@H](",
        "C(=O)N[C@@H]("
      ],
      [
        "[C@@H](C)",
        "C(N("
      ],
      [
        "[C@H](C(=O)N",
        "[C@H](C(N"
      ],
      [
        "C",
        "[C@@H](NC("
      ],
      [
        "C",
        "[C@@H](C(N"
      ],
      [
        "2CCC[C@H]2",
        "C(N("
      ],
      [
        "C(=O)N",
        "1"
      ],
      [
        "[C@@H](C)",
        "NC(=O)"
      ],
      [
        "[C@@H](",
        "C(N[C@@H]("
      ],
      [
        "C(=O)N",
        "1CCCCC1)"
      ],
      [
        "C)=O)",
        "C)CC(C)C)"
      ],
      [
        "2CCC[C@H]2",
        "C(=O)N("
      ],
      [
        "CN1",
        "C(=O)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(=O)N(C)"
      ],
      [
        "CN1",
        "C("
      ],
      [
        "CC(",
        "N2"
      ],
      [
        "CC(C)C)",
        "C)=O"
      ],
      [
        "C",
        "l)"
      ],
      [
        "CCCO",
        "C(C)C)"
      ],
      [
        "[C@H](CC(C)C)",
        "C(N(C)"
      ],
      [
        "CC",
        "1)"
      ],
      [
        "C)=O)",
        "CCC2)=O)"
      ],
      [
        "CN(",
        "Cc3ccccc3)"
      ],
      [
        "C)=O)",
        "CC(C)C"
      ],
      [
        "CN(Cc2ccccc2)",
        "C("
      ],
      [
        "(",
        "C)C"
      ],
      [
        "(",
        "c1)"
      ],
      [
        "2",
        "=O)"
      ],
      [
        "N2",
        "C(=O)"
      ],
      [
        "O=C1",
        "N("
      ],
      [
        "CN(Cc2ccccc2)",
        "C(=O)"
      ],
      [
        "[C@@H]3",
        "N(CCC3)"
      ],
      [
        "[C@H]3",
        "N(CCC3)"
      ],
      [
        "N2",
        "C("
      ],
      [
        "N",
        "1)=O)"
      ],
      [
        "C(=O)O",
        "[C@@H]1"
      ],
      [
        "[C@H](C(=O)N",
        "1)"
      ],
      [
        "C1=O)=O)",
        "=O)"
      ],
